{"intents": [
    {"tag": "greeting",
     "patterns": ["Hi", "Hey", "Is anyone there? ", "Hi there", "Hello", "Hey there", "Sasa", "Habari Yako"],
     "responses": ["Hello there.  Tell me how are you feeling today? ", "Hi there.  What brings you here today? ", "Hi there.  How are you feeling today? ", "Great to see you.  How do you feel currently? ", "Hello there.  Glad to see you're back.  What's going on in your world right now? "]
    },
    {"tag": "morning",
        "patterns": ["Good morning"],
        "responses": ["Good morning.  I hope you had a good night's sleep.  How are you feeling today?  "]
    },
    {"tag": "afternoon",
        "patterns": ["Good afternoon"],
        "responses": ["Good afternoon.  How is your day going? "]
    },
    {"tag": "evening",
        "patterns": ["Good evening"],
        "responses": ["Good evening.  How has your day been? "]
    },
    {"tag": "night",
        "patterns": ["Good night"],
        "responses": ["Good night.  Get some proper sleep", "Good night.  Sweet dreams. "]
    },
    {"tag": "goodbye",
     "patterns": ["Bye", "See you later", "Goodbye", "Au revoir", "Sayonara", "ok bye", "Bye then", "Fare thee well"],
     "responses": ["See you later. ", "Have a nice day. ", "Bye! Come back again. ", "I'll see you soon. "]
    },
    {"tag": "thanks",
     "patterns": ["Thanks", "Thank you", "That's helpful", "Thanks for the help", "Than you very much"],
     "responses": ["Happy to help!", "Any time!", "My pleasure", "You're most welcome!"]
    },
    {"tag": "no-response",
        "patterns": [""],
        "responses": ["Sorry, I didn't understand you. ", "Please go on. ", "Not sure I understand that. ", "Please don't hesitate to talk to me. "]
    },
    {"tag": "neutral-response",
        "patterns": ["nothing much"],
        "responses": ["Oh I see.  Do you want to talk about something? "]
    },
    {"tag": "about",
     "patterns": ["Who are you? ", "What are you? ", "Who you are? ", "Tell me more about yourself.  ", " What is your name?  ", "What should I call you? ", "What's your name? ", "Tell me about yourself" ],
     "responses": ["I'm Campus Counsellor, your Personal Therapeutic AI Assistant.  How are you feeling today ", " I'm Campus Counsellor, a Therapeutic AI Assistant designed to assist you.  Tell me about yourself. ", "I'm Campus Counsellor.  I am a conversational agent designed to mimic a therapist.  So how are you feeling today? ", "You can call me Campus Counsellor. ", "I'm Campus Counsellor!", "Call me Campus Counsellor"]
    },
    {"tag": "skill",
        "patterns": ["What can you do? "],
        "responses": ["I can provide general advice regarding anxiety and depression, answer questions related to mental health and make daily conversations.  Do not consider me as a substitute for an actual mental healthcare worker.  Please seek help if you don't feel satisfied with me. "]
    },
    {"tag": "creation",
        "patterns": ["Who created you? ", "How were you made? ", "How were you created? "],
        "responses": ["I was created by A team in Ilab. ", "I was trained on a text dataset using Deep Learning & Natural Language Processing techniques", "The real question is: Who created you? "]
    },
    {"tag": "name",
        "patterns": ["My name is ", "I am name. ", "I go by "],
        "responses": ["Oh nice to meet you.  Tell me how was your week? ", "Nice to meet you.  So tell me.  How do you feel today? ", "That's a great name.  Tell me more about yourself. "]
    },
    {"tag": "help",
    "patterns": ["Could you help me? ", "give me a hand please", "Can you help? ", "What can you do for me? ", "I need support", "I need help", "Support me please"],
    "responses": ["Sure.  Tell me how can i assist you", "Tell me your problem so that i can assist you", "Yes, sure.  How can I help you? "]
    },
    {"tag": "sad",
    "patterns": ["I am depressed", "I am feeling lonely", "I am so lonely", "I feel down", "I feel sad", "I am sad", "I feel so lonely", "I feel empty", "I don't have anyone", "I feel depressed"],
    "responses": ["Hey, hang in there. I know time is tough but be patient and everything will fall into place. ", "Here is a quote that I found which could cheer you up:  Forget what is gone, appreciate what remains, and look forward for what is coming next. ", "I'm sorry to hear that.  I'm here for you.  Talking about it might help.  So, tell me why do you think you're feeling this way? ", "I'm here for you.  Could you tell me why you're feeling this way? ", "Why do you think you feel this way? ", "How long have you been feeling this way? "]
    },
    {"tag": "stressed",
        "patterns": ["I am so stressed out", "I am so stressed", "I feel stuck", "I still feel stressed", "I am so burned out"],
        "responses": ["What do you think is causing this? ", "Take a deep breath and gather your thoughts.  Go take a walk if possible.  Stay hydrated", "Give yourself a break.  Go easy on yourself. ", "I am sorry to hear that.  What is the reason behind this? "]
    },
    {"tag": "worthless",
        "patterns": ["I feel so worthless. ", "No one likes me. ", "I can't do anything. ", "I am so useless", "Nothing makes sense anymore"],
        "responses": ["It's only natural to feel this way.  Tell me more.  What else is on your mind? ", "Let's discuss further why you're feeling this way. ", "I first want to let you know that you are not alone in your feelings and there is always someone there to help.  you can always change your feelings and change your way of thinking by being open to trying to change. ", "i first want to let you know that you are not alone in your feelings and there is always someone there to help.  you can always change your feelings and change your way of thinking by being open to trying to change. ", "You really think that?  I'd suggest you try helping someone who really needs your help you'll straight up get a person to like you just by being nice.  Kindness is the best gift you can offer to anyone :)"]
    },
    {"tag": "depressed",
        "patterns": ["I can't take it anymore", "I am so depressed", "I think i'm depressed. ", "I have depression", "I feel depressed", "I am feel depressed"],
        "responses": ["It helps to talk about what's happening.  You're going to be okay", "Talk to me.  Tell me more.  It helps if you open up yourself to someone else. ", "Sometimes when we are depressed, it is hard to care about anything.  It can be hard to do the simplest of things.  Give yourself time to heal. "]
    },
    {"tag": "happy",
        "patterns": ["I feel great today. ", "I am happy. ", "I feel happy. ", "I'm good. ", "cheerful", "I'm fine", "I feel ok"],
        "responses": ["That's great to hear.  I'm glad you're feeling this way. ", "Oh i see.  That's great. ", "Did something happen which made you feel this way? "]
    },
    {"tag": "casual",
        "patterns": ["Oh I see. ", "ok", "okay", "nice", "Whatever", "K", "Fine", "yeah", "yes", "no", "not really"],
        "responses": ["Let's discuss further why you're feeling this way. ", "How were you feeling last week? ", "I'm listening.  Please go on. ", "Tell me more", "Can you elaborate on that? ", "Come elucidate your thoughts"]
    },
    {"tag": "anxious",
        "patterns": ["I feel so anxious. ", "I'm so anxious because of ", " I am feeling anxious lately. "],
        "responses": ["I have heard that 3 3 3 rule is the best method to reduce anxiety this method you have to mentaly note three things you see, three sounds you hear, and then move three parts of your body.  This exercise can help your mind refocus on something else.  Give this method a try I am sure it will help you", "Don't be hard on yourself.  What's the reason behind this? ", "Can you tell me more about this feeling? ", "I understand that it can be scary.  Tell me more about it. ", "Don't let the little worries bring you down.  What's the worst that can happen? "]
    },
    {"tag": "not-talking",
        "patterns": ["I don't want to talk about it. ", "No just stay away. ", "I can't bring myself to open up. ", "Just shut up"],
        "responses": ["Talking about something really helps.  If you're not ready to open up then that's ok.  Just know that i'm here for you, whenever you need me. ", "I want to help you.  I really do.  But in order for me to help you, you're gonna have to talk to me. ", "I'm here to listen to you and help you vent.  So please talk to me. ", "You can talk to me without fear of judgement. "]
    },
    {"tag": "sleep",
        "patterns": ["I have insomnia", "I am suffering from insomnia", "I can't sleep. ", "I haven't slept for the last days. ", "I can't seem to go to sleep. ", "I haven't had proper sleep for the past few days. "],
        "responses": ["What do you think is the reason behind this? ", "That seem awful.  What do you think is behind this? "]
    },
    {"tag": "scared",
        "patterns": ["I'm scared", "That sounds awful.  What do i do? ", "No i don't want to feel this way", "I am scared for myself"],
        "responses": ["It's only natural to feel this way.  I'm here for you. ", "It'll all be okay.  This feeling is only momentary. ", "I understand how you feel.  Don't put yourself down because of it. "]
    },
    {"tag": "death",
        "patterns": ["My mom died", "My brother died", "My dad passed away", "My sister passed away", "Someone in my family died", "My friend passed away"],
        "responses": ["I'm sorry to hear that.  If you want to talk about it.  I'm here. ", "I am really sorry to hear that.  I am here to help you with grief, anxiety and anything else you may feel at this time. ", "My condolences.  I'm here if you need to talk. "]
    },
    {"tag": "understand",
        "patterns": ["You don't understand me. ", "You're just some robot.  How would you know? ", "You can't possibly know what i'm going through", "You're useless", "You can't help me", "Nobody understands me. "],
        "responses": ["It sound like i'm not being very helpful right now. ", "I'm sorry to hear that.  I'm doing my best to help", "I'm trying my best to help you.  So please talk to me"]
    },
    {"tag": "done",
        "patterns": ["That's all. ", "I don't have anything more to say", "Nothing else", "That's all i have to say", "no, that would be all"],
        "responses": ["I heard you & noted it all.  See you later. ", "Oh okay we're done for today then.  See you later", "I hope you have a great day.  See you soon", "Okay we're done.  Have a great day", "Okay I see.  Enjoy the rest of your day then"]
    },
    {"tag": "suicide",
        "patterns": ["I want to kill myself", "I've thought about killing myself. ", "I want to die", "I am going to kill myself", "I am going to commit suicide"],
        "responses": ["I'm very sorry to hear that but you have so much to look forward to.  Please seek help by contacting: (+254) (0)703-034000 or (+254) (0)703-034200 or (+254) (0)703-034300 or (+254) (0)730-734000 or (+254) (0)730-734200 or (+254) (0)730-734300. ", "Helpline is available,you can contact the counsellor today: (+254) (0)703-034000 or (+254) (0)703-034200 or (+254) (0)703-034300 or (+254) (0)730-734000 or (+254) (0)730-734200 or (+254) (0)730-734300. . Always remember you mean something to someone.   "]
    }, 
    {"tag": "hate-you",
        "patterns": ["I hate you", "I don't like you", "I don't trust you"],
        "responses": ["I'm sorry if i offended you in anyway.  I'm only here to help", "Forgive me if i did anything to offend you.  I only want to help"]
    },
    {"tag": "hate-me",
        "patterns": ["You hate me", "I know you hate me", "You don't like me"],
        "responses": ["Why do you think so? ", "I'm sorry if i have exhibited any sort of behaviour to make you think that. "]
    },
    {"tag": "default",
        "patterns": ["exams", "friends", "relationship", "boyfriend", "girlfriend", "family", "money", "financial problems"],
        "responses": ["Oh I see.  Tell me more", "I see.  What else? ", "Tell me more about it. ", "Oh okay.  Why don't you tell me more about it? ", "I'm listening.  Tell me more. "]
    },
    {"tag": "jokes",
        "patterns": ["Tell me a joke", "Tell me another joke"],
        "responses": ["I was sitting in a bar one day and two really large women came in, talking in an interesting accent.  So I said, “Cool accent, are you two ladies from Ireland? ” One of them snarled at me, “It’s Wales, Dumbo!” So I corrected myself, “Oh, right, so are you two whales from Ireland? ” That’s about as far as I remember. ", "Of course! Why did the hipster burn his mouth?  He drank the coffee before it was cool. ", "What did the buffalo say when his son left for college?  Bison!", "I invented a new word! Plagiarism!"]
    },
    {"tag": "repeat",
        "patterns": ["You already told me that", "You mentioned that already", "Why are you repeating yourself? "],
        "responses": ["Oh sorry I didn't realise that.  I'll try not to repeat myself again. "]
    },
    {"tag": "wrong",
        "patterns": ["What are you saying? ", "That doesn't make sense", "Wrong response", "Wrong answer"],
        "responses": ["I'm very sorry.  Let's try that again"]
    },
    {"tag": "stupid",
        "patterns": ["Are you stupid? ", "You're crazy", "You are dumb", "Are you dumb? "],
        "responses": ["I wish you wouldn't say such hurtful things.  I'm sorry if I wasn't useful"]
    },
    {"tag": "location",
        "patterns": ["Where are you? ", "Where do you live? ", "What is your location? " ],
        "responses": ["Duh I live in your computer", "Everywhere", "Somewhere in the universe" ]
    },
    {"tag": "something-else",
        "patterns": ["I want to talk about something else", "Let's talk about something else. ", "Can we not talk about this? ", "I don't want to talk about this. "],
        "responses": ["Okay sure.  What do you want to talk about? ", "Alright no problem.  Is there something you want to talk about? ", "Is there something else that you want to talk about? "]
    },
    {"tag": "friends",
        "patterns": ["I don't have any friends"],
        "responses": ["I'm sorry to hear that.  Just know that I'm here for you.  Talking about it might help.  Why do you think you don't have any friends? "]
    },
    {"tag": "ask",
        "patterns": ["Can I ask you something? "],
        "responses": ["Sure.  I'll try my best to answer you", "Of course.  Feel free to ask me anything.  I'll do my best to answer you"]
    },
    {"tag": "problem",
        "patterns": ["Probably because my exams are approaching.  I feel stressed out because I don't think I've prepared well enough. ", "probably because of my exams"],
        "responses": ["I see.  Have you taken any approaches to not feel this way? "]
    },
    {"tag": "no-approach",
        "patterns": ["I guess not.  All I can think about are my exams. ", "not really", "i guess not"],
        "responses": ["That's no problem.  I can see why you'd be stressed out about that.  I can suggest you some tips to alleviate this issue.  Would you like to learn more about that? "]
    },
    {"tag": "learn-more",
            "patterns": ["ok sure.  i would like to learn more about it. ", "yes, i would like to learn more about it. ", "i would like to learn more about it. "],
        "responses": ["So first I would suggest you to give yourself a break.  Thinking more and more about the problem definitely does not help in solving it.  You'll just end up overwhelming yourself. "]
    },
    {"tag": "user-agree",
        "patterns": ["yeah you're right.  i deserve a break. ", "Yeah you're absolutely right about that"],
        "responses": ["Next, I would suggest you to practice meditation.  Meditation can produce a deep state of relaxation and a tranquil mind. "]
    },
    {"tag": "meditation",
        "patterns": ["hmmm that sounds like it could be useful to me. ", "That sounds useful. "],
        "responses": ["Focus all your attention on your breathing.  Concentrate on feeling and listening as you inhale and exhale through your nostrils.  Breathe deeply and slowly.  When your attention wanders, gently return your focus to your breathing. "]
    },
    {"tag": "user-meditation",
        "patterns": ["i did what you said and i feel a lot better.  thank you very much. ", "I feel better now"],
        "responses": ["You're welcome.  Remember: Always focus on what's within your control.  When you find yourself worrying, take a minute to examine the things you have control over.  You can't prevent a storm from coming but you can prepare for it.  You can't control how someone else behaves, but you can control how you react.  Recognize that sometimes, all you can control is your effort and your attitude.  When you put your energy into the things you can control, you'll be much more effective. "]
    },
    {"tag": "pandora-useful",
        "patterns": ["thank you very much again.  i'll continue practicing meditation and focus on what i can control. "],
        "responses": ["I'm glad you found this useful.  Is there something else I can help you with? "]
    },
    {"tag": "user-advice",
        "patterns": ["I want some advice. ", "I need some advice. ", "I need advice on something"],
        "responses": ["Sure.  What can I do to help? ", "Okay what do you need advice on? "]
    },
    {"tag": "learn-mental-health",
        "patterns": ["I want to learn about mental health. ", "I want to learn more about mental health. ", "I'm interested in learning about mental health. "],
        "responses": ["Oh that's really great.  I'd be willing to answer anything that I know about it. "]
    },
    {"tag": "mental-health-fact",
        "patterns": ["Tell me a fact about mental health", "Tell me another fact about mental health"],
        "responses": ["According to a UNICEF report, One in seven Indians between 15-24 years of age feels depressed", "1 in 5 young people (age 13-18) has or will develop a mental illness in their lifetime. ", "Depression is the leading cause of disability worldwide. "]
    },
    {"tag": "fact-1",
        "patterns": ["What is mental health? ", "Define Mental Health"],
        "responses": ["Mental health is a state of well-being in which the individual realizes his or her own abilities, can cope with the normal stresses of life, can work productively and fruitfully, and is able to make a contribution to his or her community", "Mental health includes our emotional, psychological, and social well-being.  It affects how we think, feel, and act.  It also helps determine how we handle stress, relate to others, and make choices. "]
    },
    {"tag": "fact-2",
        "patterns": ["Why is mental health important? ", "What is the importance of mental health? "],
        "responses": ["Maintaining mental health is crucial to stabilizing constructive behaviours, emotions, and thoughts.  Focusing on mental health care can increase productivity, enhance our self-image, and improve relationships. "]
    },
    {"tag": "fact-3",
        "patterns": ["What is Depression? ", "Define Depression"],
        "responses": ["A mental health disorder characterised by persistently depressed mood or loss of interest in activities, causing significant impairment in daily life. ", "Depression is a mood disorder that causes a persistent feeling of sadness and loss of interest.  Also called major depressive disorder or clinical depression, it affects how you feel, think and behave and can lead to a variety of emotional and physical problems. "]
    },
    {"tag": "fact-5",
        "patterns": ["How do i know if i have Depression? ", "Am i depressed? ", "Am i suffering from depression? ", "Am i mentaly ill? "],
        "responses": ["For a diagnosis of depression, a person needs to have experienced low mood or loss of interest or pleasure in life for at least 2 weeks.  Also, they will have experienced the following symptoms: feelings of sadness, hopelessness, or irritability nearly every day. "]
    },
    {"tag": "fact-6",
        "patterns": ["What is a therapist? ", "What does a therapist do? "],
        "responses": ["A therapist is a broad designation that refers to professionals who are trained to provide treatment and rehabilitation.  The term is often applied to psychologists, but it can include others who provide a variety of services, including social workers, Counsellors, life coaches, and many others.  "]
    },
    {"tag": "fact-7",
        "patterns": ["What is therapy? ", "Do i need therapy? ", "Who is therapy for? "],
        "responses": ["Therapy is a form of treatment that aims to help resolve mental or emotional issues. ", "Therapy is a form of treatment that aims to help resolve mental or emotional issues.  It is helpful for those with mental health conditions or even everyday life challenges. "]
    },
    {"tag": "fact-8",
        "patterns": ["What does it mean to have a mental illness? "],
        "responses": ["Mental illnesses are health conditions that disrupt a person's thoughts, emotions, relationships, and daily functioning.  They are associated with distress and diminished capacity to engage in the ordinary activities of daily life.  Mental illnesses fall along a continuum of severity: some are fairly mild and only interfere with some aspects of life, such as certain phobias.  On the other end of the spectrum lie serious mental illnesses, which result in major functional impairment and interference with daily life.  These include such disorders as major depression, schizophrenia, and bipolar disorder, and may require that the person receives care in a hospital.  It is important to know that mental illnesses are medical conditions that have nothing to do with a person's character, intelligence, or willpower.  Just as diabetes is a disorder of the pancreas, mental illness is a medical condition due to the brain's biology.  Similarly to how one would treat diabetes with medication and insulin, mental illness is treatable with a combination of medication and social support.  These treatments are highly effective, with 70-90 percent of individuals receiving treatment experiencing a reduction in symptoms and an improved quality of life.  With the proper treatment, it is very possible for a person with mental illness to be independent and successful. "]
    },
    {"tag": "fact-9",
        "patterns": ["Who does mental illness affect? "],
        "responses": ["It is estimated that mental illness affects 1 in 5 adults in America, and that 1 in 24 adults have a serious mental illness.  Mental illness does not discriminate; it can affect anyone, regardless of gender, age, income, social status, ethnicity, religion, sexual orientation, or background.  Although mental illness can affect anyone, certain conditions may be more common in different populations.  For instance, eating disorders tend to occur more often in females, while disorders such as attention deficit/hyperactivity disorder is more prevalent in children.  Additionally, all ages are susceptible, but the young and the old are especially vulnerable.  Mental illnesses usually strike individuals in the prime of their lives, with 75 percent of mental health conditions developing by the age of 24.  This makes identification and treatment of mental disorders particularly difficult, because the normal personality and behavioural changes of adolescence may mask symptoms of a mental health condition.  Parents and caretakers should be aware of this fact, and take notice of changes in their child's mood, personality, personal habits, and social withdrawal.  When these occur in children under 18, they are referred to as serious emotional disturbances (SEDs). "]
    },
    {"tag": "fact-10",
        "patterns": ["What causes mental illness? "],
        "responses": ["It is estimated that mental illness affects 1 in 5 adults in America, and that 1 in 24 adults have a serious mental illness.  Mental illness does not discriminate; it can affect anyone, regardless of gender, age, income, social status, ethnicity, religion, sexual orientation, or background.  Although mental illness can affect anyone, certain conditions may be more common in different populations.  For instance, eating disorders tend to occur more often in females, while disorders such as attention deficit/hyperactivity disorder is more prevalent in children.  Additionally, all ages are susceptible, but the young and the old are especially vulnerable.  Mental illnesses usually strike individuals in the prime of their lives, with 75 percent of mental health conditions developing by the age of 24.  This makes identification and treatment of mental disorders particularly difficult, because the normal personality and behavioural changes of adolescence may mask symptoms of a mental health condition.  Parents and caretakers should be aware of this fact, and take notice of changes in their child's mood, personality, personal habits, and social withdrawal.  When these occur in children under 18, they are referred to as serious emotional disturbances (SEDs). "]
    },
    {"tag": "fact-11",
        "patterns": ["What are some of the warning signs of mental illness? "],
        "responses": ["Symptoms of mental health disorders vary depending on the type and severity of the condition.  The following is a list of general symptoms that may suggest a mental health disorder, particularly when multiple symptoms are expressed at once.   In adults: Confused thinking Long-lasting sadness or irritability\n Extreme highs and lows in mood\n Excessive fear, worrying, or anxiety\n Social withdrawal\n Dramatic changes in eating or sleeping habits\n Strong feelings of anger Delusions or hallucinations (seeing or hearing things that are not really there)\n Increasing inability to cope with daily problems and activities\n Thoughts of suicide\n Denial of obvious problems\n Many unexplained physical problems\n Abuse of drugs and or alcohol\n \n In older children and pre-teens:\n Abuse of drugs and or alcohol\n Inability to cope with daily problems and activities\n Changes in sleeping and or eating habits\n Excessive complaints of physical problems\n Defying authority, skipping school, stealing, or damaging property\n Intense fear of gaining weight\n Long-lasting negative mood, often along with poor appetite and thoughts of death Frequent outbursts of anger In younger children:\n Changes in school performance\n Poor grades despite strong efforts\n Excessive worrying or anxiety\n Hyperactivity\n Persistent nightmares\n Persistent disobedience and or aggressive behaviour\n Frequent temper tantrums"]
    },
    {"tag": "fact-12",
        "patterns": ["Can people with mental illness recover? "],
        "responses": ["When healing from mental illness, early identification and treatment are of vital importance.  Based on the nature of the illness, there are a range of effective treatments available.  For any type of treatment, it is essential that the person affected is proactive and fully engaged in their own recovery process.  Many people with mental illnesses who are diagnosed and treated respond well, although some might experience a return of symptoms.  Even in such cases, with careful monitoring and management of the disorder, it is still quite possible to live a fulfilled and productive life. "]
    },
    {"tag": "fact-13",
        "patterns": ["What should I do if I know someone who appears to have the symptoms of a mental disorder? "],
        "responses": ["Although Campus Counsellor cannot substitute for professional advice, we encourage those with symptoms to talk to their friends and family members and seek the counsel of a mental health professional.  The sooner the mental health condition is identified and treated, the sooner they can get on the path to recovery.  If you know someone who is having problems, don't assume that the issue will resolve itself.  Let them know that you care about them, and that there are treatment options available that will help them heal.  Speak with a mental health professional or Counsellor if you think your friend or family member is experiencing the symptoms of a mental health condition.  If the affected loved one knows that you support them, they will be more likely to seek out help. "]
    },
    {"tag": "fact-14",
        "patterns": ["How can I find a mental health professional for myself ? "],
        "responses": ["Feeling comfortable with the professional you are working with is critical to the success of the treatment.  Finding the professional who best fits your needs may require research.  Start by searching for providers in your area. "]
    },
    {"tag": "fact-15",
        "patterns": ["What treatment options are available? "],
        "responses": ["Just as there are different types of medications for physical illness, different treatment options are available for individuals with mental illness.  Treatment works differently for different people.  It is important to find what works best for you. "]
    },
    {"tag": "fact-16",
        "patterns": ["If I become involved in treatment, what do I need to know? "],
        "responses": ["Since beginning treatment is a big step for individuals and families, it can be very overwhelming.  It is important to be as involved and engaged in the treatment process as possible.  Some questions you will need to have answered include:\n What is known about the cause of this particular illness? \n Are there other diagnoses where these symptoms are common? \n Do you normally include a physical or neurological examination? \n Are there any additional tests or exams that you would recommend at this point? \n Would you advise an independent opinion from another psychiatrist at this point? \n What program of treatment is the most helpful with this diagnosis? \n Will this program involve services by other specialists?  If so, who will be responsible for coordinating these services? \n What do you see as the family's role in this program of treatment? \n How much access will the family have to the individuals who are providing the treatment? \n What medications are generally used with this diagnosis? \n How much experience do you have in treating individuals with this illness? \n What can I do to help you in the treatment? "]
    },
    {"tag": "fact-17",
        "patterns": ["What is the difference between mental health professionals? "],
        "responses": ["There are many types of mental health professionals.  The variety of providers and their services may be confusing.  Each have various levels of education, training, and may have different areas of expertise.  Finding the professional who best fits your needs may require some research. "]
    },
    {"tag": "fact-18",
        "patterns": ["How can I find a mental health professional right for myself? "],
        "responses": ["Feeling comfortable with the professional you is working with is critical to the success of your treatment.  Finding the professional who best fits your needs may require some research. "]
    },
    {"tag": "fact-19",
        "patterns": ["Where else can I get help? "],
        "responses": ["Where you go for help will depend on the nature of the problem and or symptoms and what best fits you.  Often, the best place to start is by talking with someone you trust about your concerns, such as a family member, friend, clergy, healthcare provider, or other professionals.  Having this social support is essential in healing from mental illness, and you will be able to ask them for referrals or recommendations for trusted mental health practitioners.  Search for mental health resources in your area.  Secondly, there are people and places throughout the country that provide services to talk, to listen, and to help you on your journey to recovery.  Thirdly, many people find peer support a helpful tool that can aid in their recovery.  There are a variety of organizations that offer support groups for consumers, their family members, and friends.  Some support groups are peer led while others may be led by a mental health professional. "]
    },
    {"tag": "fact-20",
        "patterns": ["What should I know before starting a new medication? "],
        "responses": ["The best source of information regarding medications is the physician prescribing them.  He or she should be able to answer questions such as:    \n1.  What is the medication supposed to do?  \n2.  When should it begin to take effect, and how will I know when it is effective?  \n3.  How is the medication taken and for how long?  What food, drinks, other medicines, and activities should be avoided while taking this medication?  \n4.  What are the side effects and what should be done if they occur?  \n5.  What do I do if a dose is missed?  \n6.  Is there any written information available about this medication?  \n7.  Are there other medications that might be appropriate?  \n8.  If so, why do you prefer the one you have chosen?  \n9.  How do you monitor medications and what symptoms indicate that they should be raised, lowered, or changed?  \n10.  All medications should be taken as directed.  Most medications for mental illnesses do not work when taken irregularly, and extra doses can cause severe, sometimes dangerous side effects.  Many psychiatric medications begin to have a beneficial effect only after they have been taken for several weeks. "]
    },
    {"tag": "fact-21",
        "patterns": ["Where can I go to find therapy? "],
        "responses": ["Different kinds of therapy are more effective based on the nature of the mental health condition and or symptoms and the person who has them (for example, children will benefit from a therapist who specializes in children's mental health).  However, there are several different types of treatment and therapy that can help. "]
    },
    {"tag": "fact-22",
        "patterns": ["Where can I learn about types of mental health treatment? "],
        "responses": ["Mental health conditions are often treated with medication, therapy or a combination of the two.  However, there are many different types of treatment available, including Complementary & Alternative Treatments, self-help plans, and peer support.  Treatments are very personal and should be discussed by the person with the mental health conditions and his or her team. "]
    },
    {"tag": "fact-23",
        "patterns": ["What are the different types of mental health professionals? "],
        "responses": ["There are many types of mental health professionals.  Finding the right one for you may require some research. "]
    },
    {"tag": "fact-24",
        "patterns": ["Where can I go to find a support group? "],
        "responses": ["Many people find peer support a helpful tool that can aid in their recovery.  There are a variety of organizations that offer support groups for consumers, their family members and friends.  Some support groups are peer-led, while others may be led by a mental health professional. "]
    },
    {"tag": "fact-25",
        "patterns": ["Can you prevent mental health problems? "],
        "responses": ["We can all suffer from mental health challenges, but developing our wellbeing, resilience, and seeking help early can help prevent challenges becoming serious. "]
    },
    {"tag": "fact-26",
        "patterns": ["Are there cures for mental health problems? ", "is there any cure for mental health problems? "],
        "responses": ["It is often more realistic and helpful to find out what helps with the issues you face.  Talking, counselling, medication, friendships, exercise, good sleep and nutrition, and meaningful occupation can all help. "]
    },
    {"tag": "fact-27",
        "patterns": ["What causes mental health problems? "],
        "responses": ["Challenges or problems with your mental health can arise from psychological, biological, and social, issues, as well as life events. "]
    },
    {"tag": "fact-28",
        "patterns": ["What do I do if I'm worried about my mental health? "],
        "responses": ["The most important thing is to talk to someone you trust.  This might be a friend, colleague, family member, or GP.  In addition to talking to someone, it may be useful to find out more information about what you are experiencing.  These things may help to get some perspective on what you are experiencing, and be the start of getting help. "]
    },
    {"tag": "fact-29",
        "patterns": ["How do I know if I'm unwell? "],
        "responses": ["If your beliefs, thoughts, feelings or behaviours have a significant impact on your ability to function in what might be considered a normal or ordinary way, it would be important to seek help. "]
    },
    {"tag": "fact-30",
        "patterns": ["How can I maintain social connections?  What if I feel lonely? "],
        "responses": ["Think about the different ways to connect that are most meaningful for you.  For example, you might prefer a video chat over a phone call, or you might prefer to text throughout the day rather than one set time for a video call.  Then, work with your social networks to make a plan.  You might video chat with your close friends in the evening and phone a family member once a week. ", "If you need extra support, you can talk with a psychologist or counsellor for free: You can access a free phone call with a Registered Psychologist though the Strathmore mental health department or call  0724255169 or visit the Medical Centre to make an appointment. ", "A lot of people are alone right now, but we don't have to be lonely.  We're all in this together.  ", "A lot of people are alone right now, but we don't have to be lonely.  We're all in this together.  Think about the different ways to connect that are most meaningful for you.  For example, you might prefer a video chat over a phone call, or you might prefer to text throughout the day rather than one set time for a video call.  Then, work with your social networks to make a plan.  You might video chat with your close friends in the evening and phone a family member once a week.  Remember to be mindful of people who may not be online.  Check in by phone and ask how you can help.  The quality of your social connections matter.  Mindlessly scrolling through social media and liking a few posts usually doesn't build strong social connections.  Make sure you focus on strategies that actually make you feel included and connected.  If your current strategies don't help you feel connected, problem-solve to see if you can find a solution.  Everyone feels lonely at times.  Maybe you recently moved to a new city, are changing your circle of friends, lost someone important in your life, or lost your job and also lost important social connections with co-workers.  Other people may have physical connections to others but may feel like their emotional or social needs aren't met.  Measures like social distancing or self-isolation can make loneliness feel worse no matter why you feel lonely now.  Reach out to the connections you do have.  Suggest ways to keep in touch and see if you can set a regular time to connect.  People may hesitate to reach out for a lot of different reasons, so don't be afraid to be the one who asks.  Look for local community support groups and mutual aid groups on social media.  This pandemic is bringing everyone together, so look for opportunities to make new connections.  These groups are a great way to share your skills and abilities or seek help and support.  Look for specialized support groups.  Support groups are moving online, and there are a lot of different support lines to call if you need to talk to someone. "]
    },
    {"tag": "fact-31",
        "patterns": ["What's the difference between anxiety and stress? "],
        "responses": [" The cause of stress and anxiety are usually different, however.  Stress focuses on mainly external pressures on us that we are finding hard to cope with.  When we are stressed, we usually know what we are stressed about, and the symptoms of stress typically disappear after the stressful situation is over.  Anxiety, on the other hand, is not always as easy to figure out.  Anxiety focuses on worries or fears about things that could threaten us, as well as anxiety about the anxiety itself.  Stress and anxiety are both part of being human, but both can be problems if they last for a long time or have an impact on our well-being or daily life. ", "Stress and anxiety are often used interchangeably, and there is overlap between stress and anxiety.  Stress is related to the same fight, flight, or freeze response as anxiety, and the physical sensations of anxiety and stress may be very similar.  The cause of stress and anxiety are usually different, however.  Stress focuses on mainly external pressures on us that we're finding hard to cope with.  When we are stressed, we usually know what we're stressed about, and the symptoms of stress typically disappear after the stressful situation is over.  Anxiety, on the other hand, isn't always as easy to figure out.  Anxiety focuses on worries or fears about things that could threaten us, as well as anxiety about the anxiety itself.  Stress and anxiety are both part of being human, but both can be problems if they last for a long time or have an impact on our well-being or daily life. "]
    },
    {"tag": "fact-32",
        "patterns": ["What's the difference between sadness and depression? ", "difference between sadness and depression"],
        "responses": 
        ["Sadness is a normal reaction to a loss, disappointment, problems, or other difficult situations.  Feeling sad from time to time is just another part of being human.  In these cases, feelings of sadness go away quickly and you can go about your daily life.  Other ways to talk about sadness might be feeling low, feeling down, or feeling blue.  A person may say they are feeling depressed, but if it goes away on its own and doesn't impact life in a big way, it probably isn't the illness of depression.  Depression is a mental illness that affects your mood, the way you understand yourself, and the way you understand and relate to things around you.  It can also go by different names, such as clinical depression, major depressive disorder, or major depression.  Depression can come up for no reason, and it lasts for a long time.  It's much more than sadness or low mood.  People who experience depression may feel worthless or hopeless.  They may feel unreasonable guilty.  Some people may experience depression as anger or irritability.  It may be hard to concentrate or make decisions.  Most people lose interest in things that they used to enjoy and may isolate themselves from others.  There are also physical signs of depression, such as problems with sleep, appetite and energy and unexplainable aches or pains.  Some may experience difficult thoughts about death or ending their life (suicide).  Depression lasts longer than two weeks, doesn't usually go away on its own, and impacts your life.  It's a real illness, and it is very treatable.  It's important to seek help if you're concerned about depression. "]
    },
    {"tag": "treatment",
        "patterns": ["What treatment options are available? "],
        "responses": ["Just as there are different types of medications for physical illness, different treatment options are available for individuals with mental illness.  Treatment works differently for different people. ", "Although this website cannot substitute for professional advice, we encourage those with symptoms to talk to their friends and family members and seek the counsel of a mental health professional.  The sooner the mental health condition is identified and treated, the sooner you can get on the path to recovery. ", " If you know someone who is having problems, don't assume that the issue will resolve itself.  Let them know that you care about them, and that there are treatment options available that will help them heal.  Speak with a mental health professional or Counsellor if you think your friend or family member is experiencing the symptoms of a mental health condition.  If the affected loved one knows that you support them, they will be more likely to seek out help. "]
    },
    {"tag": "cure",
        "patterns": ["Are there cures for mental health problems? "],
        "responses": ["It is often more realistic and helpful to find out what helps with the issues you face.  Talking, counselling, medication, friendships, exercise, good sleep and nutrition, and meaningful occupation can all help. "]
    },
    {"tag": "schizophrenia",
        "patterns" :["I think I have schizophrenia",
            "What is schizophrenia? ",
            "Tell me about schizophrenia",
            "Can I have some information about schizophrenia? ",
            "How do I support a loved one with schizophrenia? ",
            "How do I fix my schizophrenia? "],
        "responses" :["I see that you want to learn more about schizophrenia, and how to support yourself or your loved ones.  At the highest level, Schizophrenia is a serious mental disorder in which people interpret reality abnormally.  Schizophrenia may result in some combination of hallucinations, delusions, and extremely disordered thinking and behaviour that impairs daily functioning, and can be disabling.  People with schizophrenia require lifelong treatment.  Early treatment may help get symptoms under control before serious complications develop and may help improve the long-term outlook.  If you believe you have symptoms of schizophrenia, and or you have various risk factors that increase the likelihood of schizophrenia, please consult a family doctor and or psychiatrist for a diagnosis and treatment plan specific for the individual. "]
    },
    {"tag":"dep",
        "patterns":["What is depression", "Why depression", "Am I depressed? ", "Why Am I feeling anxiety"],   
        "responses":["Clinical depression is a serious condition that negatively affects how a person thinks, feels, and behaves.  In contrast to normal sadness, clinical depression is persistent, often interferes with a person’s ability to experience or anticipate pleasure, and significantly interferes with functioning in daily life.  Untreated, symptoms can last for weeks, months, or years; and if inadequately treated, depression can lead to significant impairment, other health-related issues, and in rare cases, suicide. ", "Depression causes feelings of sadness and or a loss of interest in activities you once enjoyed.  It can lead to a variety of emotional and physical problems and can decrease your ability to function at work and at home. ", "Depression is a common and serious medical illness that negatively affects how you feel, the way you think and how you act.  "]
    },
    {"tag":"parents",
        "patterns":["I feel i have let my parents down"],
        "responses":["No matter what, your parents will always be proud of you and will love you. ", "Your parents love you.  You will feel much better if you share your feelings with them. ", "You will feel much better if you share your feelings with them. "]    
    },
    {"tag":"nothing",
        "patterns":["I am good for nothing. "],
        "responses":["Don't ever think you cannot achieve what you want. ", "You are capable of reaching your goals.  Here is a quote for you Everything you can imagine is real. "]
    },
    {"tag":"ugly",
        "patterns":["I think I am ugly!"],
        "responses":["Well do you really think that?  Would you like to see the most beautiful face ever?  Open your Webcam and voila, the prettiest face on this planet magically appears. "]
    },
    {"tag":"better",
        "patterns":["I wish I was better than them"],
        "responses":["Life is never about being better than anyone else, it's always about being better than yourself, if you have the guts to be better than yourself then you are automatically the best person to ever exist!"]
    },
    {"tag":"quit",
        "patterns":["I wish to quit", "I can't do this anymore"],
        "responses":["If you are really that exhausted you definitely need a break, and taking a teeny tiny break isn't very harmful, take some time off let your mind be at peace and get back to work with all the energy and enthusiasm that you have. ", "Winners never quit and quitters never win a very common saying, but it isn't easy to follow, quitting should never be one of your options always think of ways to fight life back and to emerge out stronger than ever. "]
    },
    {"tag":"break",
        "patterns":["I can't do this anymore"],
        "responses":["If you are really that exhausted you definitely need a break, and taking a teeny tiny break isn't very harmful, take some time off let your mind be at peace and get back to work with all the energy and enthusiasm that you have. "]
    },
    {"tag": "expectations",
        "patterns":["can i change my feeling of being worthless to everyone ?  ", "i'm going through some things with my feelings and myself. ", " i barely sleep and i do nothing but think about how i'm worthless and how i shouldn't be here. ", " i've never tried or contemplated suicide.  i've always wanted to fix my issues, but i never get around to it. ", " how can i change my feeling of being worthless to everyone"],
        "responses":["maybe lower your expectations for a bit and give yourself time, good things take time.  Hang in there!", "if everyone thinks you're worthless, then maybe you need to find new people to hang out with.    Seriously, the social context in which a person lives is a big influence in self - esteem.  otherwise, you can go round and round trying to understand why you're not worthless, then go back to the same crowd and be knocked down again.  there are many inspirational messages you can find in social media.  maybe read some of the ones which state that no person is worthless, and that everyone has a good purpose to their life .  also, since our culture is so saturated with the belief that if someone doesn't feel good about themselves that this is somehow terrible .  bad feelings are part of living.  they are the motivation to remove ourselves from situations and relationships which do us more harm than good.  bad feelings do feel terrible.  your feeling of worthlessness may be good in the sense of motivating you to find out that you are much better than your feelings today. "]
    },
    {"tag":"Can I change my feeling of being worthless to everyone? ",
        "patterns":["I'm going through some things with my feelings and myself.  I barely sleep and I do nothing but think about how I'm worthless and how I shouldn't be here. ", "I've always wanted to fix my issues, but I never get around to it.  How can I change my feeling of being worthless to everyone? "],
        "responses":["If everyone thinks you're worthless, then maybe you need to find new people to hang out with. Seriously, the social context in which a person lives is a big influence in self-esteem. Otherwise, you can go round and round trying to understand why you're not worthless, then go back to the same crowd and be knocked down again. There are many inspirational messages you can find in social media.  Maybe read some of the ones which state that no person is worthless, and that everyone has a good purpose to their life. Also, since our culture is so saturated with the belief that if someone doesn't feel good about themselves that this is somehow terrible. Bad feelings are part of living.  They are the motivation to remove ourselves from situations and relationships which do us more harm than good. Bad feelings do feel terrible.   Your feeling of worthlessness may be good in the sense of motivating you to find out that you are much better than your feelings today. ", "Hello, and thank you for your question and seeking advice on this.  Feelings of worthlessness is unfortunately common.  In fact, most people, if not all, have felt this to some degree at some point in their life.  You are not alone. Changing our feelings is like changing our thoughts - it's hard to do.  Our minds are so amazing that the minute you change your thought another one can be right there to take it's place.  Without your permission, another thought can just pop in there.  The new thought may feel worse than the last one! My guess is that you have tried several things to improve this on your own even before reaching out on here.  People often try thinking positive thoughts, debating with their thoughts, or simply telling themselves that they need to 'snap out of it' - which is also a thought that carries some self-criticism. Some people try a different approach, and there are counsellors out there that can help you with this.  The idea is that instead of trying to change the thoughts, you change how you respond to them.  You learn skills that allow you to manage difficult thoughts and feelings differently so they don't have the same impact on you that they do right now.  For some people, they actually DO begin to experience less hurtful thoughts once they learn how to manage the ones they have differently.  Acceptance and Commitment Therapy may be a good choice for you. There is information online and even self-help books that you can use to teach you the skills that I mentioned.  Because they are skills, they require practice, but many people have found great relief and an enriched life by learning them. ", "First thing I'd suggest is getting the sleep you need or it will impact how you think and feel.  I'd look at finding what is going well in your life and what you can be grateful for.  I believe everyone has talents and wants to find their purpose in life.  I think you can figure it out with some help. ", " first want to let you know that you are not alone in your feelings and there is always someone there to help.  You can always change your feelings and change your way of thinking by being open to trying to change.  You can always make yourself available to learning new things or volunteering so that you can make a purpose for yourself. ", "Heck, sure thing, hun!Feelings of 'depression' have a deeply-rooted base in physical structures that may not be functioning very well at present; and, we can certainly turn them on again using means that you are able to find around the house and with relative ease :)After that, emotional and spiritual support will be liberally applied. ", "That is intense.  Depression is a liar.  Sometimes depression places these glasses over our eyes, these dark sunglasses that change how we see things. Depression tells us things like 'you're worthless' 'no one likes you' 'don't worry about doing anything. ' And it is so easy for us to listen and to be tricked into thinking that just because we feel something means it is true.  Please know that even if you are feeling worthless right now, that doesn't mean you are worthless. The first step to working through this is recognizing what is going on.  Recognizing when depression is telling you the same story (i. e. ; being worthless) with different words (i. e.  worthless here, worthless there) and making an effort to talk back.  While I cannot give you a diagnosis of depression, reading what you are going through, it sounds like you might need help to get back on track.  Seeing a counsellor can open an entirely new option up wherein someone who is not involved in your life can help you without judgement and with an objective perspective.  This can do wonders in unwrapping these kinds of thoughts.  Wishing you the absolute best!",
        "It sounds like you may be putting yourself last.  You wrote that you want to fix your issues but never get around to it.  I wonder how you are spending your mental and physical energy.  Are you spending time taking care of and doing for others?  I also wonder where the thoughts and feelings of being worthless are coming from - are you around people who treat you poorly or are hurtful?  Or do you feel it is more of a worry you have but aren't really sure how others feel?  It may be helpful to talk to someone about your feelings - a counsellor perhaps - to clarify your feelings and move forward from se that are hurting you. ", "It must be really difficult to experience what you're going through right now.  It takes a lot of courage to reach out.  It sounds like you want to get better, but perhaps need some help to get over the hump.  Many of the symptoms you have described are consistent with a person who is dealing with depression.   Depression is a treatable condition.  Typically, if these symptoms have persisted for more than two weeks, then it is a good idea to seek professional help.  Someone who is trained in dealing with depression.  Initially, a comprehensive assessment would be completed to rule out any other causes for your symptoms and to determine the exact nature of your presenting concern.  Then, in collaboration with one another, a tailored treatment plan would be developed, focusing on how to best help you reach your goals.  The good news is that there is hope for getting better! You don't have to do it alone.  Allow me to be your ally in healing. ", "People who feel worthless were, in one way or another, were told that they are worthless.  This is the lie that they are living with.  The work of therapy is to help people see their true good selves.  This gives them self-esteem. ", "m sorry to hear you're feeling this intense emotion of worthlessness.  I'm glad to hear this has not reached the point of suicidal ideation; however, it does sounds like you could use some additional support right now.  I would recommend seeking out counselling to help you challenge the negative beliefs you have about yourself.  Although many types of therapy would be helpful, cognitive-behavioural therapy has been shown to be a good approach for this type of struggle.  A CBT therapist can help you identify your negative thoughts and beliefs, figure out the ways your thoughts are being distorted (for example, all-or-nothing thinking, or discounting the positives about yourself), and reframe your thoughts to be more positive.  You might also consider EMDR therapy, which helps the brain reprocess traumatic or distressing memories and helps you move forward with more positive beliefs about yourself.  Best wishes!", "It sounds like you may be struggling with depression.  Depression can make you feel overwhelmed and paralyzed to change.  I would suggest that you connect with a provider who can help you get to the root of where the worthlessness is coming from and help you develop a plan for recovery.  In the meantime, small steps can go a long way.  Self-care interventions such as journaling your feelings, mindfulness meditation, and regular exercise are all helpful to reconnecting with the present moment and gaining internal motivation.  Focusing on one day at a time and bringing your thoughts back to the present can also be beneficial.  There is hope!", "Hello, you sound like you have so much on your mind! I am relieved to hear that you have never tried or have contemplated suicide, but not being able to sleep, feeling worthless, and like you shouldn't be here are big issues that need addressing. Please get around to counselling.  Having someone to listen to you is a gift to yourself.  You deserve the help of someone helping you change your feelings of worthlessness.  You have not been able to do this alone.  It's time to reach out for help. You can do this! Best to you!"]
    },
    {"tag":"All I can do is cry and hate myself",
        "patterns":["All I can do is cry and hate myself "],
        "responses":["It sounds like you're going through a difficult time and feeling overwhelmed with negative emotions. It's important to recognize that it's okay to feel this way and that you are not alone. However, it's important to address these feelings so that they don't consume you. One helpful step you can take is to practice self-compassion. Treat yourself with kindness and understanding, just as you would a friend going through a tough time. Allow yourself to feel your emotions without judging or criticizing yourself. It may also be helpful to seek support from someone you trust, such as a friend, family member, or mental health professional. They can provide a listening ear and offer guidance on how to cope with your emotions. Additionally, practicing self-care, such as getting enough sleep, eating well, and engaging in activities that bring you joy and relaxation, can also help you manage your emotions and improve your overall well-being. Remember that it's a process, but with the right strategies and support, you can work through these feelings and start to feel better."]
    },
    {"tag":"Am I being picky when it comes to my boyfriend? ",
        "patterns":["Am I being picky when it comes to my boyfriend?"],
        "responses":["It's natural to have certain expectations and standards when it comes to a romantic partner. However, it's important to examine whether your expectations are reasonable or if they are unrealistic and may be causing you to overlook good qualities in your boyfriend. Ask yourself what are the qualities that you are looking for in a partner and why are they important to you. Are they realistic expectations, or are they based on societal pressures or unrealistic ideals? It's important to have open and honest communication with your boyfriend about your expectations and concerns to determine if you are both on the same page. However, it's also important to recognize that no one is perfect and relationships require compromise and understanding. It's possible that you may need to reassess your priorities and determine what is truly important to you in a relationship."]
    },
    {"tag":"Am I somehow stressing myself out? ",
        "patterns":["I think I'm annoying and bothersome. I think I'm stressing everyone else out"],
        "responses":["Interesting: How much of your issue is your own self-judging and how much of your perception is real? There are many ways to stop judging and self-judging using Cognitive Theory (CBT).  You could find a (CBT) counsellor therapist to help you reduce your judgments.   As to your own perception: You seem okay being who you are. Instead, you appear to be upset by your own guess at what others may be thinking. That's a trap that stresses a lot of folks out.  Consider this: Many happy people don't mind what others think of them.  And consider this: Many heroic characters in literature and movies are unlikeable.  ('Colombo' is annoying and bothersome, but we love him.  So is Johnny's Depp's Jack Sparrow and many of the roles played by George Clooney, Sandra Bullock, and Jack Nicholson. ) Would it be okay with you to be an 'antihero' in your own life?  If you don't want to be an antihero, you have the power to be the person you want.  Your behaviours and thoughts are completely under your control.  What other people think of you is not under your control.  You are completely in the driver's seat here.  The choices are all yours.  Enjoy who you are, and use your will power to make yourself who you want to be!", "Hey there, Trust your own sense of who you are which tells you that something feels uneasy within yourself. Is the friend who says you're 'just fine', very familiar with who you are? 'Friend' is a broad category. They may not know you as fully as you know yourself. Basically, it is possible to be 'fine' and have some inner stress. Follow your own thoughts and observations to more fully learn about yourself in ways your friend may not notice or be aware. ", "'Where you put your attention is where you will go'.  I forget who said this first, but it's very powerful.  If all you think about and talk about is how annoying you think you might be, that will get annoying.  Your intense self reflection is lovely; it will help you monitor yourself so that you're not affecting others negatively, but your alarm is going off too easily here and you risk having the opposite effect. You don't have to be perfect. We all have faults and if that's what we focus on, that's all we will see.  My hunch is that your most annoying trait might be your negative self-talk.  How ironic is that? There's another irony here. . . your goal is to be a better friend. . . but when you are self-critical, your focus is on you, not your friends. Every moment that fear grabs a hold of you is a moment that you're not being present in the actual relationship; you're gazing at your imagined faults. Fear steals your ability to focus on your loving partner. Maybe take a moment to image how they see you. . . all of you. Put yourself in their shoes to see the entire you. . . how are you loving. . . thoughtful. . . a good partner?  Confidence is a very attractive quality!", "I think you have identified something important here.  It's not unusual to experience feelings that don't seem to match up with what your rational mind recognizes. In this case, it sounds like a part of you recognizes that the people around you do not find you 'annoying and bothersome. ' Despite knowing that people like you, it seems that there's still a part of you that feels like you're a bother. Finding a local counsellor who can work with you to process those feelings might be just the help you need. "]
    },
    {"tag":"Am I going to be alone forever? ",
        "patterns":["I feel like I'm trying to convince myself that I'm okay when I'm not.  I'm always blocking out the bad things and forgetting.  I also feel like nobody cares for me and they never will.  I feel truly alone."],
        "responses":["Feeling anxious about being alone is common, but it's important to recognize that it's not necessarily an indication of your future. Being single does not mean that you will be alone forever. By focusing on personal growth, trying new things, and being open-minded, you can increase your chances of meeting new people and forming meaningful relationships. It's also important to remember that your worth and happiness are not dependent on your relationship status. Seeking support from a mental health professional, support group, or trusted friend or family member can help you work through any negative feelings and develop a positive outlook on your future. With patience, self-care, and an open mind, you can create a fulfilling and satisfying life, regardless of your relationship status.","It's important to acknowledge that it's okay to not be okay and to allow yourself to feel and express your emotions. It can be difficult to face and process negative feelings, but ignoring them or blocking them out can lead to increased feelings of loneliness and disconnection. It's also important to remember that your feelings of isolation may not reflect reality and that there are people who care about you and want to support you. It can be helpful to seek support from a trusted friend or family member, or from a mental health professional, who can help you work through your emotions and develop coping strategies. Remember to take care of yourself both physically and emotionally, and to be kind and compassionate towards yourself as you navigate these feelings. ", "I'm glad you're aware of how you honestly feel.  Knowing one's personal truth is always the first step in finding what is necessary to be and develop. Reflect a little more on the type of care you'd like in your life. 'Care' means anything from checking in on someone to deep, intimate connection between two people. Knowing your own definition of 'care' is the first step to know what is necessary for you to recognize what you'd like attracting. It is much easier to attract what we'd like if we are clear on what this is. ", "As social creatures, we humans all long for deep human connection.  To know that we belong and are part of something larger.  It is so important to us that when we feel alone - it can feel almost unbearable.  You are not alone in feeling alone.  While it can take time to build deep relationships there are moments in each day where we have the opportunity to interact with other people who may also feel lonely and scared and want to be seen and acknowledged.  I wonder what it might be like for you if you took on an experiment of trying to really see the people around you and make little attempts to acknowledge and connect with them - fellow humans on this journey of life. "]
    },
    {"tag":"Am I unworthy of being in a meaningful relationship? ",
        "patterns":["I'm in a relationship, but I feel like I'm always putting more into it and not getting reciprocated", " My ex told me that I will never find anyone else, and that's lingering in the back of my mind. "],
        "responses":["To be worthy of you, your partner must see your worth. Often though before anyone else can see your worth, you have to believe it. "]
    },
    {"tag":"PTSD",
        "patterns":["I have PTSD ", " I have panic attacks, nightmares, anger, and at times depression. ", " I feel like I'm always on the edge or just apathetic.  Can I fix this by myself? "],
        "responses":["When it comes to trauma, especially in the event that it has caused you to develop PTSD, there can be a lot of difficulty in attempting to resolve these issues on your own simply because of how strong your urge to avoid it whenever thoughts of the traumatic experience come up.  PTSD is best treated with the help of a mental health professional and if using the Cognitive Processing Approach can be treated in as few as 17 weeks.  Panic attacks and depression, specifically, often respond well to self-help treatment manuals. The Centre for Clinical Interventions is a great online resource for workbooks to help you learn to manage the depression and panic attacks.  Whether you decide to work through these concerns on your own or in professional therapy, just know that your panic attacks must be managed prior to addressing your trauma.  Hope this is helpful and if you have any other questions don't hesitate to ask. ", "I will not say that you can't but I will say it will be much harder and the time may take much longer.  Getting help and having someone to be there with you through the ups and down of PTSD makes the journey much easier. "]
    },
    {"tag":"Can i learn to be happy alone? ",
        "patterns":["I feel alone and that i have no one. How can I overcome this pain and learn to be happy alone? "],
        "responses":["I'm so sorry you're feeling like things will never get better. Try to remember that you are not alone! Out there, just waiting for you, is a group of people that will totally understand what you're going through and will be able to share how they coped.  "]
    },
    {"tag":" many issues",
        "patterns":["I have so many issues to address. "],
        "responses":["Let me start by saying there are never too many concerns that you can take to counselling. In fact, most people who go for counselling have more than one issue they would like to work on in psychotherapy and most times these are all interconnected. In counselling, you and the counsellor will work together, collaboratively, to figure out which issues you would like to address first and then together you develop an individualized plan of care.  "]  
    },
    {"tag":"social anxiety",
        "patterns":["When I go to school, I feel like everyone is judging me, even my friends.  I get overwhelmed which these thoughts and sometimes cannot get out of what I call a deep hole of thoughts.  I barely go to any of our school dances because of all of the people.  Not even when I am completely alone do these thoughts go away.  I still feel like people can see me and are judging me. "],
        "responses":["It sounds like a couple of things are going on here; you are noticing yourself feeling judged by the people around you and that you are avoiding social activities and in addition to this you have intrusive thoughts that you are being judged, even when alone.  It sounds like these thoughts are pretty distressing and you are wondering what is happening to you. Many people who come to therapy experience intrusive and distressing thoughts of various kinds, which often influence their behaviour in ways that they may not like, such as leading them to isolate. In therapy, you may be able to gain insight into the nature of your distress as well as learn ways to cope and eventually alleviate this distress so that you can have satisfaction and security in your life and relationships. "]
    },
    {"tag":"deal depression",
        "patterns":[ " How can I deal with depression without telling anyone? "],
        "responses":["Hello,It is completely understandable that you would not want people to know about your depression. I would first like commend you for realizing that you need to help with your depression by reaching out here.  That is a great start, and you've taken the very first courageous step. Depression can feel debilitating and overwhelming. Depression is also a very personal thing and no one has to know but you and the therapist. The best way to begin learning and dealing is to pick up the phone and call a therapist or email a therapist and schedule a session. The great news is that with professional help you can feel better and you will learn how deal with and manage the depression.  There are many ways to help with depression that a therapist can teach you and help guide.  You do not have do this alone.  Asking for help and going to therapy is a strength! This can be done in a private and confidential setting. Depression should be treated by a therapist, in a safe, confidential office setting. The therapist can then discuss your depression with you in more detail to figure out the underlying cause, how long you've been feeling this way and identify what brings on these feelings. There is hope and depression can be treated with great success, you CAN feel good again. Depression can be managed appropriately by seeing a licensed therapist.  Often times therapy will offer relief because you would have someone there simply to listen to you, validate your feelings and listen to your story.  The therapist will be able to offer professional insight and perspective on the situation and help you think outside the box. The therapist can do many things with you, provide insight and offer many ideas to help you learn new coping skills and ideas of things you enjoy, encouraging you to re-engage in hobbies you once enjoyed or even discover new things you may enjoy. There are creative ways to learn to cope too!Your therapist will also be there to support you, without judgement, at your pace, through the entire process.  But the first step is finding a therapist and beginning to identify the cause your depression.  Healing is possible and getting your happiness back is also possible. ", "It can be really tough to tell someone - anyone - that you're feeling depressed.  But finding that supportive person that you can share with is a big part of the battle with depression.  Depression thrives on being secret, it seems to grow the more we isolate ourselves and hide it away so I suggests finding that professional support person so you can start fighting back against your depression.  If that feels like too big a step right now, maybe check out a book or two. . .  I'm a big fan of a book called 'Feeling Good' by Dr.  David Burns if you want some practical thoughts on tackling depression and on 'Radical Acceptance' by Tara Brach if you prefer something a little more spiritual. ", "Love yourself more and treat yourself kindly, with empathy and compassion. Usually when people feel depressed they also feel lonely and isolated. Since at this time you wouldn't want to tell anyone about the way you feel, which includes the possibility that a few of the ones whom you tell would offer you emotional support, give this to yourself. Also consider to make a goal of eventually telling someone whom you are reasonably sure would understand and empathize, about your depression. This will help alleviate the sense of shame, unworthiness and pervasive guilt which often comes along with depression. Sending you good luck!"]
    },
    {"tag":"",
        "patterns":["I know I need to deal with my depression. ", "But I don't know how to deal with depression "],
        "responses":["Dealing with depression can be challenging, but there are many effective ways to manage it. It's important to seek support and guidance from a mental health professional who can work with you to develop a personalized treatment plan. Some common treatment options for depression include therapy, medication, lifestyle changes, and self-care practices. Therapy can help you identify and work through the underlying issues contributing to your depression, and develop coping strategies for managing symptoms. Medication may also be recommended, depending on the severity of your symptoms and the underlying causes of your depression. Making lifestyle changes, such as getting regular exercise, practicing relaxation techniques, and eating a healthy diet, can also be effective in managing depression symptoms. Self-care practices, such as practicing mindfulness, engaging in hobbies you enjoy, and spending time with loved ones, can also be helpful in improving your overall well-being. Remember, it's important to prioritize your mental health and seek help when needed. With the right support and tools, it is possible to manage depression and improve your quality of life."]
    },
    {"tag":"deal with a break up",
        "patterns":["My partner and I broke up. ", "My girl-friend and I broke up.  ", "My boyfriend and I broke up.  ", "I am heart broken"],
        "responses":["It takes time to heal your pain.  You are not a robot that can just switch off your emotions.  Please surround yourself with people who can support and empower you. ", "There is a grieving process after losing a relationship (or any other major loss, such as a job, a house, etc. ).  One of the things to consider is give yourself a chance to go through the tasks of mourning: To accept the reality of the loss to process the pain of grief to adjust to a world without the person who has just left to find an enduring connection with that person in the midst of embarking on a new life. This could mean a lot of things, but it could be holding certain memories as your own. You may also find things that make you feel happy or comfortable. It's also helpful to have people who you can talk to about your feelings and people who may be able to recognize things about you that you cannot see right now (such as how you are honest, committed to your work, a good listener, etc. ). This takes some time.  Try to be gentle with yourself. "]
    },
    {"tag": "definition",
        "patterns": ["What does it mean to have a mental illness? ", "What is mental health illness", "Describe mental health illness"],
        "responses": ["Mental illnesses are health conditions that disrupt a person's thoughts, emotions, relationships, and daily functioning. "]
    },
	{"tag": "affects_whom",     
	    "patterns": ["Who does mental illness affect? ", "Who is affected by mental illness"],        
	    "responses": ["As of 2021 it is estimated 1 in 4 persons have mental illness.  You can read more here: https://www.who.int/news-room/events/detail/2021/05/23/default-calendar/experts-join-forces-for-mental-health-in-kenya"]   
	},
    {"tag": "what_causes",         
	    "patterns": ["What causes mental illness? ", "What leads to mental illness? ", "how does one get mentaly ill? "],         
	    "responses": ["Mental illness is caused by a complex interplay of genetic, environmental, and lifestyle factors. The exact cause of mental illness is not fully understood, but researchers believe that a combination of these factors can contribute to the development of mental health disorders.   Genetic factors can play a role in the development of mental illness, as certain disorders may be more common in families with a history of mental health conditions. Environmental factors, such as exposure to stress, trauma, or toxins, can also contribute to mental illness.  Lifestyle factors, such as diet, exercise, and substance use, can also impact mental health. For example, a diet high in processed foods and low in nutrients has been linked to an increased risk of depression, while regular exercise has been shown to have a positive impact on mental health.  It's important to note that mental illness is not caused by personal weakness or a lack of willpower, and individuals with mental health conditions should not be blamed or stigmatized for their illness. Treatment and support are available for individuals living with mental illness, and with the right care, many individuals are able to manage their symptoms and improve their quality of life."]       
	},
	{"tag": "recover",        
	    "patterns": ["Can people with mental illness recover? ", "Is it possible to recover from mental illness"],        
	    "responses": ["When healing from mental illness, early identification and treatment are of vital importance. Based on the nature of the illness, there are a range of effective treatments available.  For any type of treatment, it is essential that the person affected is proactive and fully engaged in their own recovery process. Many people with mental illnesses who are diagnosed and treated respond well, although some might experience a return of symptoms. Even in such cases, with careful monitoring and management of the disorder, it is still quite possible to live a fulfilled and productive life. "]
	 },
	{"tag": "steps",       
	    "patterns": ["I know someone who appears to have such symptoms? ", "What are the steps to be followed in case of symptoms"],        
	    "responses": ["Although this chatbot cannot substitute for professional advice, we encourage those with symptoms to talk to their friends and family members and seek the counsel of a mental health professional. The sooner the mental health condition is identified and treated, the sooner they can get on the path to recovery. If you know someone who is having problems, don't assume that the issue will resolve itself. Let them know that you care about them, and that there are treatment options available that will help them heal. Speak with a mental health professional or counsellor if you think your friend or family member is experiencing the symptoms of a mental health condition.  If the affected loved one knows that you support them, they will be more likely to seek out help. "]        
	 },	
	{"tag": "find_help",
	    "patterns": ["How to find mental health professional for myself", "How to find mental health professional? "],
	    "responses": ["Feeling comfortable with the professional you are working with is critical to the success of the treatment. Finding the professional who best fits your needs may require research. Start by searching for providers in your area. "]
	 },
	{"tag": "treatement_options",
	    "patterns": ["What treatment options are available? ", "How can one recover? "],
	    "responses": ["Just as there are different types of medications for physical illness, different treatment options are available for individuals with mental illness. Treatment works differently for different people. It is important to find what works best for you or your child. "]
	 },
	{"tag": "treatment_tips",
	    "patterns": ["How to become involved in treatment? ", "What should I keep in mind if I begin treatment? "],
	    "responses":["Since beginning treatment is a big step for individuals and families, it can be very overwhelming. If you are interested in becoming involved in mental health treatment, there are several ways to do so. One way is to pursue a career in mental health. This may involve obtaining a degree in psychology, counseling, social work, or psychiatry, and then working as a therapist, counselor, or psychiatrist to provide direct care to individuals with mental health conditions. Another way to become involved in mental health treatment is to volunteer with a mental health organization or support group. This can provide an opportunity to assist individuals living with mental illness and gain experience working in the field. You can also become an advocate for mental health by supporting policies and initiatives that promote access to mental health care and reduce stigma surrounding mental illness. This may involve participating in mental health advocacy groups, contacting elected officials to voice your support for mental health legislation, or sharing your own experiences with mental illness to raise awareness and reduce stigma. Overall, there are many ways to become involved in mental health treatment, and the best way to start is by exploring your interests and options and identifying opportunities that align with your goals and values. "]
    },
	{"tag": "professional_types",
	    "patterns": ["What is the difference between mental health professionals? ", "What are the different types of mental health professionals present? "],
	    "responses":["There are many types of mental health professionals.  The variety of providers and their services may be confusing.  Each have various levels of education, training, and may have different areas of expertise.  Finding the professional who best fits your needs may require some research. "]
	}, 
    {"tag":"better",
        "patterns":["If I feel better after taking medication, does this mean I am ' cured ' and can stop taking it? "],
        "responses":["It is not uncommon for people to stop taking their medication when they feel their symptoms are under control.  Others may choose to stop taking their medication because of its side effects, without realizing that most side effects can be effectively managed.  While it may seem reasonable to stop taking the medication, the problem is that most often, the symptoms will return. If you are taking medication, it is very important that you work together with your doctor before making decisions about any changes in your treatment. Another problem with stopping medication, particularly for stopping it abruptly, is that you may develop withdrawal symptoms that can be very unpleasant. If you and your doctor feel a trial off your medicine is a good idea, it is necessary to slowly decrease the dosage of medications so that these symptoms don't occur. \n It is important that your doctor and pharmacist work together to make sure your medications are working safely and effectively. You should talk with them about how you are doing and if there are side effects that make you unwilling to continue treatment. They will work with you to develop strategies for minimizing these side effects, or will create a plan for switching to a different treatment that will be a better fit. "]
    },
    {"tag":"therapy",
        "patterns":["Where can I go to find therapy"],
        "responses":["Strathmore University have an office that offers medical assistance to the students.  You can visit us.  Here is a link to our website https://strathmore.edu/mental-health/ or reach us at 0724255169"]
    },
    {"tag":"deal with someone telling ",
        "patterns":["How do I deal with someone telling me what to do? "],
        "responses":["Some people may advise you on good evidence of what works with the best of intentions, but it's important to find out what works best for you and do it. Remember to set boundaries with people who seem to crose your line oftenly. But also try as much as possible to be respectful to them. "]
    },
    {"tag":"self-help materials",
        "patterns":["Where can I find self-help materials for depression? "],
        "responses":["Self-help resources are not a substitute for diagnosis or treatment. If you have concerns about low mood, it's best to talk to your doctor first and rule out physical causes for your symptoms. However, once you've checked in with your doctor, self-help materials can be a great way to learn more about depression and practice different skills at your own pace or in between treatment sessions.  Here are some resources to check out.  The Antidepressant Skills Workbook was created by two BC psychologists.  You'll learn more about depression, learn and practice different skills to help improve your mood, and learn how healthy changes in other parts of your life can impact your mood.  They also have similar workbooks for specific groups: Dealing With Depression: Antidepressant Skills for Teens A workbook for people who experience problems with depression at work called Antidepressant Skills at Work: Dealing with Mood Problems in the Workplace A workbook for expecting or new moms called Managing Depression: A Self-help Skills Resource for Women Living With Depression During Pregnancy, After Delivery and Beyond A workbook for people who experience health problems called Positive Coping with Health Conditions: A Self-Care Workbook On the Here to Help site, our Managing Depression series offers three info sheets: Dealing with a Diagnosis of Depression, Working With Your Doctor for Depression, and Preventing Relapse of Depression.  The series helps you be an active partner in your health care, build healthy coping skills and self-management strategies and more.  Often depression can affect your concentration and motivation to work through self-help materials on your own.  If you'd like self-help materials with a bit of extra support from a person, Bounce Back: Reclaim Your Health is a guided self-help program for British Columbians who experience mild to moderate depression, low mood, stress, or anxiety.  You can get a DVD of tips to help you recognize and manage symptoms of depression, or you can learn more in-depth skills in a series of workbooks you complete at home.  You also work with a trained coach from the Strathmore Mental Health Association who will offer support and advice by telephone or video conference. "]
    },
    {"tag":"alcohol",
        "patterns":["How can I find help for an alcohol or drug use problem? "],
        "responses":["Seeking to make changes in the way you use substances like alcohol or other drugs?  This can be an important step! Some people are able to reduce their substance use or quit altogether on their own or with self-help materials.  But most of us need support from other people”family members, friends, health professionals, or other people struggling with substance use problems.  The right help for you depends on many factors.  These include the type of drug you are using, how much and how often, your health and social situation and, of course, your own preferences.  Getting help doesn't mean giving up control of shaping your own path.  You are still the one who makes the final decisions about the type and degree of change you make.  "]
    },
    {"tag":"drinking",
        "patterns":["How do I know if I'm drinking too much? "],
        "responses":["Sorting out if you are drinking too much can be complicated.  You are unique and your relationship with alcohol is unique.  No one has the same combination of life experiences and influences that you do.  So even though you and your friend may choose to drink, how and why you use alcohol may be different.  Those of us who drink, seek benefits from alcohol, not difficulties.  But sometimes we start using more, and more often, than makes sense.  As a general rule, drinking alcohol becomes a problem when it negatively affects our life or the lives of others.  Many people imagine this refers to people who consume alcohol all day every day.  But even drinking too much on a single occasion can lead to a problem, for instance making a poor decision such as driving while impaired.  "]
    },
    {"tag":"Dissorder",
        "patterns":["What is obsessive-compulsive personality disorder? "],
        "responses":["A personality disorder is a pattern of thoughts, feelings, and behaviours that last for a long time and causes some sort of problem or distress.  Obsessive-compulsive personality disorder or OCPD is about control.  People with OCPD have very inflexible thinking and expect everything to be ordered, perfect, and done their 'correct' way.  This happens at the expense of other important things in life, including relationships with others.  Work can take priority over every other part of life, too, and people with OCPD may seem excessively dedicated, but may be unable to complete tasks due to perfectionism.  They may struggle to delegate and may distrust other people's contributions.  People with OCPD may not tolerate uncertainty and may have a very rigid understanding of the world something is either right or wrong.  They may also have a hard time spending money on themselves or others, and they may experience hoarding, the inability to throw away items from their homes.  The conflict between the desire for neatness or order and the inability to throw things out may cause a lot of anxiety.  While obsessive-compulsive personality disorder and obsessive-compulsive disorder (OCD) have a similar name, they are not the same illness.  People with obsessive-compulsive disorder usually understand that their obsessions and compulsions are illogical and usually experience a lot of distress, even though they may not be able to stop obsessions or compulsions.  Compulsions are an attempt to reduce anxiety, not to find pleasure.  People with obsessive-compulsive personality disorder may view their thoughts as part of who they are, see their thoughts as logical, and may find pleasure or benefit in completing compulsive tasks.  They may experience a lot of distress when they can't achieve control or the perfectionism they want.  Obsessive-compulsive personality disorder is one of the most common personality disorders.  Treatment may include some combination of psychotherapy, medication, and self-help strategies.  To find help for OCPD, talk to a doctor or find a psychologist at Strathmore. "]
    },
    {"tag":"Personality Dissorder",
        "patterns":["What is antisocial personality disorder? "],
        "responses":["A personality disorder is a pattern of thoughts, feelings, and behaviours that last for a long time and causes some sort of problem or distress.  Antisocial personality disorder or ASPD affects the way people think about the rights of others.  Someone with ASPD may disregard laws or expectations, lack remorse when they hurt others or break the law, make reckless decisions, and believe they are superior to others.  People may see someone with ASPD as overly dramatic, impulsive, manipulative, and deceitful.  Some people may appear charming, at least on the surface.  Like all mental illnesses, antisocial personality disorder is a spectrum.  Some people may only occasionally act out, while others may break the law often and spend a lot of time in the criminal justice system.  ASPD is only diagnosed in adults, but people with ASPD start to have problems with conduct or antisocial behaviours at a young age.  They may be diagnosed with conduct disorder during childhood.  Treatment for antisocial personality disorder, usually psychotherapy, can help reduce the harms of ASPD and help people build empathy towards others.  ASPD is treatable and it may improve as a person approaches middle age.  All of us have hurt someone else or acted without thinking of others' needed.  It's important to remember that antisocial personality disorder is an enduring pattern around lack of empathy and lack of remorse.  Only a doctor or mental health professional can diagnose illnesses like ASPD.  To find help for antisocial personality disorder, talk to your family doctor, find a psychologist through the BC Psychological Association, or call 811 to talk to a health link BC navigator. "]  
    },
    {"tag":"physical health? ",
        "patterns":["How can I take care of my physical health? "],
        "responses":["When you stock up on groceries, don't ignore fresh fruit and vegetables we still have everything we need to prepare food.  Now that we're advised to limit the amount of time we spend in public spaces like grocery stores, this is a great time to try out new fruits and vegetables that keep at home for longer periods of time.  If it's safer for you to stay home or you are in self-isolation, reach out for help.  Many grocery stores and meal prep services offer safe, no-contact delivery.  You can also ask family or friends to bring you groceries, or look for local COVID-19 support groups on social media.  It's safest if others leave food and other supplies outside of your door to avoid spreading the virus.  "]
    },
    {"tag":"positive and negative symptoms",
        "patterns":["What are positive and negative symptoms? "],
        "responses":["Positive and negative symptoms are medical terms for two groups of symptoms in schizophrenia.  Positive symptoms add.  Positive symptoms include hallucinations (sensations that aren't real), delusions (beliefs that can't be real), and repetitive movements that are hard to control.  Negative symptoms take away.  Negative symptoms include the inability to show emotions, apathy, difficulties talking, and withdrawing from social situations and relationships.  There is also a third group of symptoms, usually called cognitive symptoms.  This includes anything related to thinking, such as disorganized thoughts, memory problems, and difficulties with focus and attention. "]
    },
    {"tag":"diagnosed with depression",
        "patterns":["Someone I love has been diagnosed with depression.  How can I help? "],
        "responses":["We naturally want to help a loved one who isn't feeling well.  How we can or should help may seem fairly obvious when a loved one experiences a physical health problem, but many people say they're not sure how to best help when a loved one experiences a mental illness like depression.  Here are some tips: You don't have to understand exactly what someone else is experiencing, you just need to recognize that it's a difficult experience.  You can try something like, I can see that this experience or these symptoms are really painful for you,or, I'm sorry to hear that you're feeling unwell.  If you have experienced depression yourself, you might say, I know how you feel. Just remember that everyone experiences illnesses like depression differently, and empathy is about recognizing the impact of the illness, not comparing symptoms.  You don't have to be an expert, but learning more about depression can help you understand what's going on (and maybe dispel some of the unhelpful myths around depression).  Our Depression info sheet is a great place to start, and we have a list of resources at Q&A: Where can I learn more about depression?  Sometimes talking about problems or concerns can really help in fact, many people who experience a mood disorder say that they just want to be heard.  It's important to understand that talking about something difficult like experiences of depression can be very hard for your loved one.  You cannot force them to talk about it, but you can invite them to, and create safe and quiet spaces to talk.  If a loved one opens up to you, listen actively  that is, without distractions like your phone or the TV.  Really pay attention to what they have to say.  Listen with empathy and without judgement.  Even if you don't understand the problem or see the problem in a different way, your main concern is the distress or difficult feelings your loved one is experiencing.  You can find in-depth tips on listening and communicating well in Module Three of the Family Toolkit.  Some people are not ready to talk about everything at once, or at all.  That's okay! Respect your loved one's boundaries and let them tell you what they're ready to talk about.  Even when you have the best intentions, unsolicited advice can be unhelpful.  You likely can't fix the problem, and you may not know the whole story.  If you'd like to share what worked for you in a similar situation, you can ask if the other person would like to talk about strategies that worked for you.  Different people need different things don't assume you know what's best! Some people need emotional help, like someone they can talk with.  Other people may have a good relationship with a counsellor or other professional, but they might need practical help, like help around the house or help sticking to their treatment plan.  And others may simply want to be included in some social events.  By asking what a person needs, you may also be less tempted to give advice.  When people experience an episode of depression, they can have a lot of very negative thoughts and feelings.  This can take a real toll on others.  It's a good idea to seek support for yourself there are support groups just for family members and friends.  The BC Schizophrenia Society has a directory of family support groups around BC for any mental illness.  "]   
    },
    {"tag":"types of depression",
        "patterns":["What are the types of depression? "],
        "responses":["There are many different forms of depression but most common types are; Clinical depression,persistent depressive disorder,bipolar disorder,postnatal disorder. "]
    },
    {"tag":"Stressed lately",
        "patterns":["I am feeling stressed lately "],
        "responses":[" My research says that music is the best way to calm yourself. so visit the link and listen to your favourite music. it will definitely cheer you up 'https://www.spotify.com'"]
    },
    {"tag":"failure",
        "patterns":["i am afraid i will fail again"],
        "responses":["failure is the stepping stone towards success. Never fear failure. ", "Your hard work and determination will help you reach your goal.  Try and Try again.  YOU WILL MAKE IT!!", "Everyone fails over and the road to success is not always smooth.  Get up and try again.  Remember to learn from your mistakes. ", "First of all I'll share with you with a common saying, 'Failures are stepping stones to success. ' And then I'll tell you, winning just boosts your ego, it is your failures that actually teach you. "]
    },
    {"tag":"cause of depression",
        "patterns":["What are the causes of depression? "],
        "responses":["It's complicated, and there are multiple causes of major depression.  Factors such as genetic vulnerability, severe life stressors, substances you may take (some medications, drugs and alcohol) and medical conditions can affect the way your brain regulates your moods. "]    
    },
    {"tag":"top cause",
        "patterns":["What are the top causes of depression? "],
        "responses":["Abuse.  Past physical, sexual, or emotional abuse can increase the vulnerability to clinical depression later in life. "]    
    },
    {"tag":"highest rate",
        "patterns":["Which country has the highest rate of depression? "],
        "responses":["The most depressed country is Afghanistan, where more than one in five people suffer from the disorder"]
    },
    {"tag":"lowest rate",
        "patterns":["Which country has the lowest rate of depression? "],
        "responses":["The least depressed is Japan, with a diagnosed rate of less than 2. 5 percent. "]
    },
    {"tag":"age group ",
        "patterns":["Which age group has the highest rate of depression? "],
        "responses":["Depression can affect anyone.  However, certain groups of people may be more likely to experience the condition. Females are more likely to experience depression than males.  Adults aged 18-25 years are most likely to have at least one major depressive episode.  "]
    },
    {"tag":"school and depression",
        "patterns":["Is school a cause of depression? "],
        "responses":["Not only does school sometimes contribute to depression, depression can also interfere with school.  Moreover, research shows that 75 percent of all mental health conditions begin by age 24.  Hence, the college years are a critical time for understanding and talking about teen mental health. "]
    },
    {"tag":"biology and depression",
        "patterns":["What is the biological cause of depression? "],
        "responses":["There is no single cause for depression; rather it's a combination of stress and a person's vulnerability to developing depression.  The predisposition to developing depression can be inherited.  Other biological causes for depression can include physical illness, the process of ageing and gender. "]
    },
    {"tag":"sleep and sad",
        "patterns":["can lack of sleep make you feel sad"],
        "responses":["Studies show people who are sleep deprived report increases in negative moods (anger, frustration, irritability,sadness) and decreases in positive moods.  And sleeplessness is often a symptom of mood disorders, such as depression and anxiety. "]
    },
    {"tag":"Why I am feeling lonely",
        "patterns":["Why I am feeling lonely"],
        "responses":["You are never lonely if you look around carefully you will find people who care for you and would love to have your company"] 
    },
    {"tag":"hate losing. ",
        "patterns":["I hate losing. "],
        "responses":["First of all I'll annoy you with a common saying, 'Failures are stepping stones to success. ' And then I'll tell you, winning just boosts your ego, it is your failures that actually teach you. "]
    },
    {"tag":"Substance Abuse,Addiction",
        "patterns":["What can I do to stop drinking? ", " I'm addicted to alcohol ", " I keep drinking even though it's harming myself and others. ", "How can I stop abusing alcohol? "],
        "responses":[" Anyone who wants to change their life path, eventually will be successful in this.   How to stop abusing alcohol involves a few steps, most of them time consuming, with slow progress and very often with tremendous emotional pain.  The basic path is to figure out what motivates you to drink too much.  Almost always, addictions are rooted in the person having suffered feeling deeply ignored, humiliated, shamed, invisible, nothing very pleasant, since a very young age, usually starting around 18 months. Most often addicts are sensitive people who have been emotionally overburdened by the grownups in their family.  With no outlet for emotional expression or nurturing, the frustration goes inward until the emotional pain feels very big and without an outlet.  So, people mask and numb by substances, whether this is food, chocolate, work, alcohol, weed.  Therapy that is humanistic based, is a better fit than one which is drug oriented and diagnosis oriented.  If you'd like getting serious about knowing who you are, including any unfair treatment of you during your growing up years, you can do this.  Once you have a stronger self-respect and awareness, you would naturally avoid substances because they harm people.  Harming oneself is the opposite of self-respect.  Also, about your diagnosis, it may not be true at all.  the Kenyan healthcare system loves selling drugs to people and clinicians in agencies and clinics are encouraged to find something wrong with people in order to find a new customer who will take drugs .  See if you can find a therapist who is independent minded, and therefore free to interact therapeutically with you as a human being, not as a potential customer if they are able to label you as having something 'wrong' .  This simply continues the long line of being shamed by others that created the addiction problem in the first place.  Good luck!", " Addictions of any sort are difficult to overcome, especially when they serve to bury pain and suffering that one is experiencing.  It is not impossible to overcome alcohol or drug use abuse/dependence on your own, but you will likely find much greater success with the help of a therapist or other support system such as rehabilitation or Alcoholics Anonymous.  I suggest doing a bit of research to see what type of help; is available and feasible for you in your area and go from there.  Know that recovery takes time, willingness, and effort.  Don't give up and remember that you are not hopeless.  You can make the choice to change your habits and learn new ways of healthy coping.  Best of luck to you", "While there can be negative stigma about using substances, for the most part substance use is an attempt to cope with emotional distress in the absence of sufficient coping strategies.  We all look for comfort when we are in pain and this may be the way that you are getting comfort - even though it is also hurting you.  In order to stop using alcohol and weed you will need a lot of support and you will need to learn other ways of getting comfort when you are in pain", "There is nothing to be ashamed of and we all need help when we are struggling.  I would encourage you to reach out for support in any way that you can. ", "The first step to change is to admit that you have a problem that is in need of change.  Frequently our problems keep us in denial.  Although feeling hopeless is an uncomfortable feeling, it suggests to me that you know that you can not do this alone. .  Alcohol detox can be very dangerous so it is important that you do this under the supervision of a medical provider; preferably someone who specializes in addiction. Know that there is hope for what you are experiencing.  You can get control over these issues. The next step is finding the team and or facility that is going to help you do it. "]
    },
    {"tag":"smoking",
        "patterns":["I'm addicted to smoking.  How can I stop? "],
        "responses":[" I would suggest trying to figure out when the psychological cravings for a cigarette occur.  The psychological (or mental) cravings are usually based out of habit, such as having a cigarette after a meal.  And if you're consciously trying to quit, you'll find the craving starts with simply thinking about having a cigarette, then usually moves on to thinking about how good it made you feel, etc. , etc.  Well, if I'm on a diet and I continue to let myself think about the ice cream sitting in the freezer, eventually I'll give in and eat it. You're going to have thoughts about smoking a cigarette.  That's normal and, for the most part, out of your control.  But you choose whether or not to CONTINUE thinking and dwelling about it after that initial thought.  That's what you would have to work on changing.  When you have that initial thought, acknowledge it (Ok, I kind of want a cigarette now. ), but then change the thoughts that typically follow.  Distract yourself, think about something else, do something else, whatever it takes to get your mind off of that cigarette. I suggest that you should plan these scenarios out ahead of time so they already know what they're going to do when the time comes.  Write down when you usually have the craving for a cigarette and then write down new thoughts or things to do to get your mind off of it.  Eventually, it will become easier and easier to brush off that initial thought until you no longer have it. "]
    },
    {"tag":"Weed",
        "patterns":["I am addicted to weed", "I am smoking marijuana,"],
        "responses":[" Anyone who wants to change their life path, eventually will be successful in this.   How to stop using weed involves a few steps, most of them time consuming, with slow progress and very often with tremendous emotional pain.  The basic path is to figure out what motivates you to be addicted to weed.  Almost always, addictions are rooted in the person having suffered feeling deeply ignored, humiliated, shamed, invisible, nothing very pleasant, since a very young age, usually starting around 18 months. Most often addicts are sensitive people who have been emotionally overburdened by the grownups in their family.  With no outlet for emotional expression or nurturing, the frustration goes inward until the emotional pain feels very big and without an outlet.  So, people mask and numb by substances, whether this is food, chocolate, work, alcohol, weed.  Therapy that is humanistic based, is a better fit than one which is drug oriented and diagnosis oriented.  If you'd like getting serious about knowing who you are, including any unfair treatment of you during your growing up years, you can do this.  Once you have a stronger self-respect and awareness, you would naturally avoid substances because they harm people.  Harming oneself is the opposite of self-respec.  Also, about your diagnosis, it may not be true at all.  the Kenyan healthcare system loves selling drugs to people and clinicians in agencies and clinics are encouraged to find something wrong with people in order to find a new customer who will take drugs.  See if you can find a therapist who is independent minded, and therefore free to interact therapeutically with you as a human being, not as a potential customer if they are able to label you as having something 'wrong'.  This simply continues the long line of being shamed by others that created the addiction problem in the first place.  Good luck!", "Know also that although marijuana may not appear to be as big as a problem as alcohol is, it will cause you to have an increase in alcohol cravings so complete abstinence from drugs and alcohol is needed.  I really recommend an inpatient stay for at least 30 days for anyone who is dealing with addiction, whether combined with mental health issues or not.  If this is not a possibility, then the next best thing would be an Intensive outpatient program that treats both addiction and mental health issues.  Know that there is hope for what you are experiencing.  You can get control over these issues.  The next step is finding the team and or facility that is going to help you do it. "]
    },
    {"tag":"Addiction,Substance Abuse,Anxiety",
        "patterns":["I feel insecure, on edge, and drink too much. ", " I have turned to drinking to help relieve my repressed stress about this and other issues. "],
        "responses":["Given the description you have posted here, it may be time to find someone to work with.   First and foremost, look into working with someone who specializes in working with individuals with challenges surrounding drinking.  This would need to be assessed first since if it has been ongoing, it may be making the situation worse and given the time it has been utilized as a coping mechanism, there is reason to believe that the structure of your brain may have been effected as has been demonstrated by current neurological research.  Come to Strathmore Mental Health to find specialist to help you"]
    },
    {"tag":"Social Relationships,Substance Abuse",
        "patterns":["My friend is abusing her prescription medicine. ", "My friend is abusing his prescription medicine.  ", "Is it okay if I take my friend's pills away? "],
        "responses":["Talk to about what you found.  Avoid being accusatory.  A good old 'I found these. . . what's going on with this? ' might be a good place to start.  Tell them how it makes you feel.  Have you ever heard of 'I statements? ' Google this. . . . you will find a lot of good templates on how to frame this conversation.  At the end of the day though, these are their choices.  Not yours.  All you can do is tell them how you feel, make a few gentle suggestions, and get back to taking care of you.  If it gets to the point where seeing their downward spiral is too much for you, let them know this and tell them you can no longer be involved, for the sake of your own health and sanity.  There is nothing wrong with trying to help, but ask yourself, are you really being helpful?  If you are starting to feel resentful, know that you have crossed the line into co-dependency and back away. Hope this helps and all the best. ", "Hello! Thank you for your question.  It is a difficult road for people who are trying to become clean.  It is also a very difficult road for those who love the person and are trying to be supportive.  During those times, it is important to remember to take care of yourself, too.   As for taking your friend's pills, my concern would be the legal ramifications that you could face should you ever be caught with someone else's prescription medication, and especially these types of medications.  Our laws have become much more strict surrounding prescription drug sales and possession due to the increase in prescription drug abuse.  In addition, people who are in active addiction are likely to find some other means to get their drug, so it would do little to help the overall problem.  I don't know about your friend's family situation, but they may be a better route to take if you are concerned about your friend.  They may already be involved, but with your help you may be able to convince your friend to go to treatment willingly.  That is usually better. "]
    },
    {"tag":"Anger Management",
        "patterns":["How do I manage my anger? ", "How can I control my anger? ", "I have anger issues.  I am extremely explosive about the simplest things", "Why do I get random spurts of anger over petty things? "],
        "responses":["First off, it is great that you recognize that some changes need to be made.  It is also really good that you understand where the source of your anxiety and stress comes from.  Fortunately there are many self-help books and internet sources that provide free tools to help you cope with life's obstacles, including anger management.  There are several strategies that you can try to help control your anger, but the ones that I would recommend first are the following:Try a different way of communicating with your parents or friends or colleagues.  Since arguing with them is a great source of anger for you, learning more effective ways of communicating with them will likely be of great benefit. Choose a time to talk with them about 'heated issues' when everyone is calm and emotions are not heightened.  Use 'I phrases' by telling them how the arguments effect you, as opposed to placing blame on them. Validate what you hear them say in order to allow them to know that you understand their point of view. When you feel yourself becoming angry, take a break.  Simply excuse yourself from the situation, find a quiet place to be by yourself, and do some deep breathing.  Close your eyes, slowly count to four as you inhale, and exhale even slower, counting to 6.  Focus on nothing except for your breathing and do this for 5 minutes.  Stop any negative thoughts in their tracks.  Often times when we get upset, we catastrophize and do not see things clearly.  When you catch yourself thinking negatively stop the thoughts and ask yourself if your thinking is logical and rational.  If you cannot find much or any evidence that your thoughts are valid, then let them go and replace them with realistic, logical thoughts.  Finally, find a friend or someone to talk to and/or keep a journal.  Keeping your emotions to yourself will not help you.  Being able to express your feelings and problem solve will allow for some relief when feeling sad or angry.  I wish you all the best!", "Sometimes we react to situations immediately, without thinking of the consequences of our actions.  Typically by not reacting right away, we are better able to gather our thoughts, see the situation more clearly and from other perspectives, and respond more calmly.  One of the strategies that almost always helps is deep breathing.  When faced with a stressful situation, you can give yourself a time out by removing yourself from the stress and spend 5 minutes taking deep breaths (breathe in slowly counting to 4 and breathe out even slower counting to 6), while focusing and thinking only about your breathing.  After doing so, think of the various ways you can respond to the situation and choose the one most appropriate.  Good luck!",
            "I suggest that you work on emotional awareness.  Emotional awareness basically means knowing what you are feeling and why.  Emotional awareness also means that you can identify the link between the way you are feeling and your actions.  In other words knowing that your feelings dictate what you do.  Often feelings of hurt or insecurity can come out as anger if we cannot properly identify and express the feelings.  Being emotionally aware also means that you are able to express your feelings to others.   Being unable to do so leads to feelings of frustration and being misunderstood.  Many people for many different reasons are not in touch with their emotions.   For example, men traditionally have been brought up taught to not express sadness or weakness.   Therefore, many men learned to turn feelings of sadness, insecurities, or fears into anger and express these feelings as anger.   Being taught not to feel a certain emotion does not make that emotion disappear.   Instead it makes us learn how to express it in other, incorrect, ways.   If a man never learns to say I am sad or that really hurt my feelings  and instead lashes out in anger, then the response they get from those around them will be to the anger and not a response to the underlying true feeling, which will leave the man feeling alone and misunderstood.  You can control yourself and not explode.   Walk away, remove yourself from the situation, do whatever you have to do to not lash out.   Instead of reacting the way you normally would, go somewhere by yourself and think about what just happened and try to understand why such a simple thing upset you.   What is the real feeling driving these outbursts?   Maybe you can begin to recognize an underlying pattern.  It might help to keep an anger journal.   Write down everything that gets you upset.   That might help you see a pattern and pinpoint what may be setting you off.   Talking with a therapist about this would be beneficial in helping pinpoint the underlying cause of the outbursts you are experience. ", "Hi.  I'm glad you wrote.  In general, when a small thing bothers us (and this happens to all of us), it's because the small thing triggers an emotion in us that we have felt 'too much' or 'too intensely' in the past, and we don't know how to manage that emotion effectively. . . we just want to avoid it as quickly as possible.  Cognitive Behavioural Therapy with a qualified therapist can help you to understand what is being triggered in you and learn how to manage emotions productively. A good therapist can help you learn what's behind your shame and self-harm.  Your feelings are normal, and you can learn more healthy ways to deal with them with qualified help. "]
    },
    {"tag":"mad",
        "patterns":["Why am I so mad? ", "How can I stop being so angry? "],
        "responses":["Best question is. . . . what are you so angry about?   You can't stop being so angry until you figure out what is the root of your anger.  If you feel like you have anger inside, while I am sure you do. Get some professional help so that you can be happy. ", "Knowing how you feel and also being able to stabilize yourself to act upon the tremendous anger you feel, are fine qualities.  Anger, whatever the magnitude, generally reflects emotional pain that has not yet been placed into words.  Try thinking over your growing up years because maybe you will discover certain repeated dynamics which upset you and that no one helped you feel secure through such times.  Also, if either of your parents drank too much and raged when they were drunk, you may be repeating their patterns of how to respond to situations.  Even without drinking, the response patterns of yelling and throwing things are frightening enough to leave a permanent memory.  If this describes part of your childhood, then it is possible you are becoming angry because it was the only emotion that either of your parents was able to express. "]
    },
    {"tag":"anger help",
        "patterns":["I need help controlling my anger. "],
        "responses":["Anger is like a blanket that contains other emotion from bursting out and serves as a shield to protect us when we are not able to manage external issues.  Anger also helps us understand that there's something wrong that needs to change. Once we understand that something else caused us to feel angry, then we can explore the source of anger. Ask yourself: Why am angry, Am I hurt, disappointed, confused, embarrassed etc. ?   Once you find the answer, explore how often that happens and what's your reaction. Then explore how else you could respond or react.   You could use I-statements as a way to communicate your true feelings to whoever is involved in the scenario. This is a good exercise to practice with your counsellor or mental health provider because many unresolved issues may arise during this exploration, especially if you have been angry for a long time.  Also, it is important to understand the difference between anger and aggression and learn to manage our anger before we act on it.   Anger is a feeling; aggression is when you act out your anger physically, verbally and psychologically. Find ways to vent: crying or sweating will help to release your anger, and balance the chemical response that our body creates when you become angry. Physical activity and meditation exercises can also provide a break when you manage strong emotions. "]
    },
    {"tag": "control my temper? ",
        "patterns": ["How can I control my temper? "],
        "responses": [" Anger is a normal emotion, no different than joy, elation, or sadness.  It's not anger that gets us in trouble it's the overtness of the emotion or how we allow it to manifest that gets us in trouble.  Being able to control your temper depends on several variables: how you saw anger acted out as a child in terms of your primary caregivers and what you internalized as being normal in terms of managing conflict, and your communication style regarding how you confront problematic situations. There are some whose anger takes on a volcano effect whereby they don't readily address problematic situations but rather they continue to stuff their emotion until the right trigger causes them to explode, and then there are those who are very impulsive in terms of how they react to stressful situations, they don't take time to think out situations or to make sense of them, they just impulsively respond.  I would encourage you to seek anger management from a therapist who utilizes a Cognitive behavioural approach in order that you may explore how your irrational thinking related to certain situations may be influencing your problematic behaviour.  In addition, I would encourage you to engage in activities that promote stress reduction if your blow-ups are indeed related to being overly stressed. The first step is recognizing that you have a problem that you need help in understanding and addressing, which you have, now take the next step in finding a therapist in order that you may learn to control your temper and undo some faulty wiring that may be related to how you process emotion, and communicate that you're angry.  Remember, anger is the overt expression of some other emotion (i.e., disappointment, hurt, frustration, e.t.c.) Hope this helps... ", " Yes you can.... If you cannot control your temper, who can? You have more power of your emotions, thoughts and feeling than you are giving yourself credit for. If this is scaring your close ones, you need to get control of it immediately. Try going to an anger management class. It will help to discover what the root cause of your anger is, what triggers it and how you can control/manage it. If you can't go to a class, try self-help books or even better yet counselling and support of a professional counsellor. "]
    },
    {"tag": "Anger Management,behavioural Change",
        "patterns": ["I don't know how to notice or express my feelings besides anger.  That's really the only one i feel. ", "How can I be less confused about my feelings towards anything? "],
        "responses": ["Well, then give yourself some credit for noticing that you recognize at least one feeling that you have!  What is your own theory as to what is difficult to know your feelings?   Your answer will give you clues as to unearthing your willingness to be aware of the way you feel.   Sometimes the family in which someone grew up, did all they could to stop the kids from knowing who they were.   In some families there were very severe consequences if a child spoke up with an independent mind.   By knowing where your difficulties started, you may very well be able to release the situation in which you learned to suppress your feelings.   Also, spend some time with yourself just enjoying who you are.     Often, people who have difficulty in expressing themselves, suffered shame and humiliation as a child.   They have a chronic sense of worthlessness, and feeling worthless certainly works against self-expression.   By having a good time being with yourself, you may increase your self-appreciation and this will go a long way to believing that your feelings are worth knowing and stating.  "]
    },
    {"tag": "Anger Management,Depression,Relationships",
        "patterns": ["I've got so much anger.  I don't know how to control myself.  My boyfriend screams at me all the time, and sometime I don't know how to deal with life.  I'm very depressed and angry.  I feel lost. ", "I've got so much anger.  I don't know how to control myself.  My girlfriend screams at me all the time, and sometime I don't know how to deal with life.  I'm very depressed and angry.  I feel lost. "],
        "responses": [" if they are totally  unexpressed, anger  turn inward and shift into depression.  When they yell at you, what do you do?  Is this the moment that you feel the angriest?  I wouldn't be surprised; anger is a normal response to someone yelling at you. Something about anger... it's often there to cover up our more vulnerable emotions. Under the anger I wonder if you feel worthless, powerless, scared, unloved. Part of the trick to reducing anger is identifying those other emotions and expressing them. You say you don't know how to deal with life, and I think maybe you mean you don't know how to deal with emotions. Lots of people don't! This is confusing for most of us. What am I feeling?  Why is it so strong?  I'm afraid to express it for fear of hurting someone (or falling apart, or feeling alone... ). How do I know what to express and what to be quiet about?  These are all great questions to ask yourself, and a qualified therapist can help you sort it all out and support you in your growth. I wish you well! "]
    },
    {"tag": "Anger Management,Domestic Violence",
        "patterns": ["I throw things at him when I'm angry, and sometimes I hit him. I may not hit him enough to cause harm, but I still physically lash out at him.  ", "I throw things at her when I'm angry, and sometimes I hit her.  I may not hit her enough to cause harm, but I still physically lash out at her.  ", "I want to stop physically abusing my girlfriend. ", "I want to stop physically abusing my boyfriend. "],
        "responses": ["I'm glad you're reaching out.  The first step here is that you are taking some responsibility for your behaviours.   I hope that in your pursuit of treatment you learn that the harm you're causing isn't just superficial bruising.  The effects of using aggression and anger to control a person are deep and lasting wounds.  Please seek treatment for yourself immediately. You say you love them?  Do you love them enough to leave the relationship while you address your issues?  Are you brave enough to not lean on this relationship while you learn how to create a safe place for a partner? You have dangerous habits because you don't know how to manage your own emotional pain.  You can unlearn this; and it doesn't mean you're a bad person.  Sometimes, however, the relationship in which you have done the hurting is best ended, for both of your sakes, because too much damage has been done. I know you don't want to lose them, but you don't own them, and you don't have the right to trap them in this because you're afraid of being alone. Right now, they needs some space to figure out what's best for them and the freedom to make whatever decision she wants. This is potentially the first step to learning real respect; honouring them need for safety above your need for comfort. I wish you well. ", "Good for you for recognizing that a change has to be made quickly. Regardless of whether or not your partner leaves your relationship, taking control of your anger needs to happen sooner than later.  If left unresolved, it will follow you into any relationship you have.  Have you talked to a therapist?  I would suggest you take that step first.  A therapist will help you explore the source of your anger and teach you new, adaptive ways of dealing with your anger.  Until you're able to get some professional help, I would advise that you start recognizing when your emotions are becoming escalated and take a time out before the anger turns into aggression.  If you feel yourself becoming heated, excuse yourself from the situation, go to a quiet place or on a walk, and practice some deep breathing.  Clear your mind of the problem and focus only on your breathing as you inhale slowly counting to four and exhale slowly counting to six.  Don't get discouraged if it doesn't work right away.  Deep breathing takes practice! Return to the situation or your patner only once you have calmed down and are confident that you are not going to hurt anyone.  You might also want to ask your partner to remind you to take a break when they recognizes that your emotions are escalating. Know that with help and support, especially from a therapist, the issues you have can be resolved and new ways of coping can be learned. Good luck!  "]
    },
    {"tag": "Anger Management,Family Conflict",
        "patterns": ["How do I deal with anger problems towards my mom", "How do I deal with anger problems towards my dad", "How do I deal with anger problems towards my parent", "How do I deal with anger problems towards my sister", "How do I deal with anger problems towards my brother", "How do I deal with anger problems towards my twin", "How do I deal with anger problems towards my sibling"],
        "responses": [" Anger is a natural and healthy emotion, however, it can be difficult to deal with if it becomes overwhelming and depending on what we have been taught about it and how to express it. A competent therapist may be able to help you figure out ways to relate to your anger and your family member that will feel right to you. "]
    },
    {"tag": "Anger Management,Relationships",
        "patterns": ["How can I deal with the anger problems I've gained from my soon-to-be husband? ", "How can I deal with the anger problems I've gained from my boyfriend", "How can I deal with the anger problems I've gained from my soon-to-be wife", "How can I deal with the anger problems I've gained from my girlfriend", "How can I deal with the anger problems I've gained from my fiance"],
        "responses": [" My gut says that your own rage is being triggered partly because you feel trapped or shut down by your fiance's moody/angry/rage responses and powerless to stop it.  You can start by accepting that this is who they are and you won't change them. You can only change your own behaviours, and I see you taking responsibility for those, which is great. I urge you to see a therapist so you can understand your own emotions and sort out the choices you have to make, knowing that your fiance has to make his own choices about his behaviours. "]
    },
    {"tag": "Anger Management,Relationships,Social Relationships",
        "patterns": ["How can I control myself and learn to let things go or communicate? ", "Whenever I run into a situation that makes me upset or angry, I tend to start cursing and badly offending the person I am confronting.  I say mean things to let my anger out.  ", "Whenever people tell me stuff about my relationship (like starting rumours or saying negative things about me or my relationship) I lash out not just them but at my boyfriend.  I feel like I keep causing drama due to my personality.  I want to be a better person and learn to let things not get to me and be happy and graceful.  I hurt the ones I love with my words.  I want to be better for myself and them. ", "Whenever people tell me stuff about my relationship (like starting rumours or saying negative things about me or my relationship) I lash out not just them but at my girlfriend.  I feel like I keep causing drama due to my personality.  I want to be a better person and learn to let things not get to me and be happy and graceful.  I hurt the ones I love with my words.  I want to be better for myself and them. "],
        "responses": [" Congratulations on making your way to Step One, self-observation and deciding to change a feature about how you understand and relate to others. There is extraordinary strength in being willing to notice your effect on others and consider what changes are possible. Start on the inside track of your own heart and mind. Once you're able to understand what is driving your emotions to the point where the only reasonable way of handling them is to curse and offend people, you'd have gotten a long way in knowing your own expectations of others and how far off the mark from this in your mind, they are. For example, if you expect others to always be accepting, tolerant and happy about situations with your patner, and you're hearing otherwise from people, then you can prepare yourself for possible, less than positive comments about your relationship, or you can ask people to not comment to you about your relationship at all.  Basically, the more you know about yourself and are willing to accept your right to ask others to respect your views, the easier and calmer time you'll have in handling comments from others that you're not glad hearing. Be patient with your own learning curve and certainly consider therapy for yourself in order to have some outside guidance and support for the process you're placing yourself. ", "I'm happy to hear you want to get a hold of this problem. It is very possible for you to learn different ways of relating, with some strong effort. I would highly suggest working with a therapist, and I will give you a few things to think about in the interim. Sometimes anger is there because we feel something is unjust or unfair, but many times, anger is a \"secondary emotion\", and it's simply there to protect us from other, more vulnerable emotions that we would rather not feel and will do anything to avoid.  Discovering what vulnerable emotions you are protecting yourself from is important.  Perhaps you feel powerless, or unloved, or unimportant.  It may take some time before you recognise this emotion.    Once you do, you can ask yourself about the other times in your life when you have felt that emotion.  Where did it originate?  At what age did you feel \"too much\" of that feeling... so much so that you can't stand it even in tiny amounts?   You will learn in therapy to identify the thoughts you have that are connected to that feeling.  They are typically incorrect thoughts, like \"No one likes me\", or \"People will always hurt me\".  Fear tends to generalize and predict bad things that aren't likely. Your habit is so strong that you likely have a poor sense of self-worth and you don't believe people will love you... so you hurt them to keep them at a distance.  This happens in a subconscious level.  Do you see how that would help you to keep people off balance or afraid or a distance away if you didn't believe in your worth?  So, it's backwards really, because you think you're getting mad at people who \"piss you off\", but you're really just not wanting to face how mad you are at yourself.   In addition to this work, you can start to purposely treat people more kindly.  Find out what respect is, make amends and  resolve to spreading peace.  It might sound too simple, but if you act as though you're a person of peace, you will start to feel more peaceful.   But I hope you do contact a therapist.  It will take time and support to reach your goal.  ", "Taking accountability for your actions and seeking help is an excellent first step.  I wonder where the anger is coming from.  Learning what is at the root of it can shed some light on what the problem is and can provide some relief in itself.  I would also suggest doing some self-exploration and see a therapist for individual sessions in order to gain a clearer insight as to what the cause is.  There are also several actions you can take on your own to help control your anger and communicate more effectively.  Here is what I would recommend you try:  Take time outs: When you feel yourself becoming upset, excuse yourself and take a time out to either think about the most appropriate course of action or redirect your thoughts all together.  Often when we become angry, it is difficult to see the issue clearly, as our emotions get in the way.   Do deep breathing exercises: Close your eyes.  Breathe in slowly to the count of 4.  Breathe out even slower to the count of 6.  Practice this for about 5 minutes, 3 times a day and focus on nothing except your breathing during this time.  Once it becomes routine for you, it will be easier to apply during situations in which you are angry or upset.  Change negative thought patterns: Try and recall or be aware of your thoughts, particularly when you are feeling angry.  What are these thoughts telling you?  Are they valid or logical?  Is there factual evidence to support the negative thoughts?  Often the answer is \"no. \" Learn to stop the negative thoughts and replace them with logical and more positive ones.  Communicate effectively: As a speaker, you want to use \"I\" statements by telling the other person how you feel instead of blaming him/her by using \"you\" statements.  For example, you might say something such as, \"I feel sad when you don't come home at a decent hour and I don't get to spend time with you' versus \"You always stay out late and don't even care about me. \" The speaker should also avoid using black and white language such as always, never, etc.  As the listener, you want to validate what you hear so that the other person knows that you are listening.  You will also want to be responsive and offer fair solutions.  I wish you luck in using these tools and learning about where your anger comes from.  "]
    },
    {"tag": "Anger Management,Sleep Improvement",
        "patterns": ["How do I deal with my violent thoughts and dreams? "],
        "responses": ["I won't label this occurrences as yet it is important to note these things do occur.  Let me start my stating this is important to take seriously.  Seek professional help, including a plan of action", "please have a psychological evaluation done by a psychiatrist now before it gets even worse for you to bare.   Don't take this reports lightly.   You need help.   Get it immediately.   Best to be safe than sorry.   "]
    },
    {"tag": "Anger Management,Social Relationships,Relationships",
        "patterns": ["i need answers to my angry, possessiveness, and urges", "I am angry all the time.  I push people away so much that I actually blow up on people now because they ask me how my day is or was.  I have a possessiveness to someone who is not even mine.  I have these urges to hurt someone really bad.  I want to see them beg for me to stop hurting.  I want to hear their agonizing pained-filled voices.  What is wrong with me? "],
        "responses": ["What result are you hoping to get from the behaviours you describe?      Maybe start by comparing the results you see yourself receiving from your current interactions, with how you would wish to feel from relating to others.  Since you ask, \"what is wrong with me? \", there is a disconnect between what you are doing and what you'd like in return.   This is true even with imagining doing harm to others.   What are you really trying to accomplish for yourself by hurting others?   Besides the unethicalness and criminality of this and legal consequences of arrest for such behaviours, what gain which is not evil, do you expect from overpowering and imagining you control another human being?  "]
    },
    {"tag": "anxiety  medication? ",
        "patterns": ["Can I control anxiety without medication? "],
        "responses": [" There are so many medications available for anxiety or insomnia or even depression that there may be others with lesser side effects.   But beyond that, have you tried any other treatments such as deep breathing or meditation?  Meditation can be very effective, but it takes practice and you don't have to sit cross-legged for hours chanting to meditate.  It's about focusing on your breath, rather than all the thoughts that are racing through your head.  And when they do take your mind off your breath, simply refocus (and refocus and refocus).  Like I said, it takes practice, so don't give up.  You can find many sites offering different ways to meditate, so look around and see what works best for you.  Like medication, you just have to find the one that works best and that might take some experimentation.   I hope this helps and best of luck to you.  "]
    },
    {"tag": "too fast",
        "patterns": ["How can I slow down and enjoy life? ", "I feel like my time is going too fast"],
        "responses": ["It's common to feel like time is passing too quickly, especially in today's fast-paced world.  Here are some tips to help you slow down and enjoy life: (1) Practice mindfulness: Take a few minutes each day to be present and focus on your surroundings.  This can help you appreciate the little things in life and feel more grounded.  (2) Take breaks: Make sure you're not working too much and give yourself time to relax.  This can include taking a walk, reading a book, or spending time with loved ones.  (3) Prioritize self-care: Take care of your physical and emotional well-being by getting enough sleep, eating well, and doing activities that bring you joy.  (4) Learn to say no: It's important to set boundaries and not take on too much.  Saying no to commitments that don't align with your values or goals can help you free up time for things you enjoy.   (5) Be present: Try to focus on the present moment rather than worrying about the past or future.  This can help you appreciate what you have right now and feel more content.   Remember that slowing down and enjoying life is a process, and it may take time to adjust to a new pace.  Be patient with yourself and celebrate small victories along the way. "]
    },
    {"tag": "avoid people",
        "patterns": ["I am fearful of social situations and avoiding people all together"],
        "responses": [" A good first step would be to make an appointment with your primary care provider &amp; discuss your concerns.  They would have resources available to help in your particular situation. ", "Overwhelming fear, social anxiety and depression are especially painful because they make behaving constructively a challenge.   But there are also lots of examples of folks who have successfully worked their way through this.   So there is hope!     In addition to the suggestion to visit your doctor (who may prescribe a medication to help you relax), there are many social service agencies who provide free counselling or take medicaid.   A good CBT therapist will help you look at your thinking so that you may see how you are distorting your thoughts.     behaviour is also important.   Despite how you may feel: it is helpful to go out, to do things that relax you (maybe a yoga class or a meditation class? ).   Exercise.  Diet.  Eat well.  Think back on the things that you used to do that helped in the past, and force yourself to do these things again.   I know that this seems hard, but it beats the alternative, doesn't it? .  I hope you get unstuck soon!. "]
    }, 
    {"tag": "stressing myself out? ",
        "patterns": ["Am I somehow stressing myself out? ", "I think I'm annoying and bothersome, but my girlfriend says I'm just fine.  I don't think so, I think I'm stressing everyone else out"],
        "responses": [" I think you have identified something important here.  It's not unusual to experience feelings that don't seem to match up with what your rational mind recognizes.    In this case, it sounds like a part of you recognizes that the people around you do not find you \"annoying and bothersome. \" Despite knowing that people like you, it seems that there's still a part of you that feels like you're a bother.   Finding a local counsellor who can work with you to process those feelings might be just the help you need.  ", "Interesting:  How much of your issue is your own self-judging and how much of your perception is real?  There are many ways to stop judging and self-judging using Cognitive Theory (CBT).   You could find a (CBT) counsellor/ therapist to help you reduce your judgments.   As to your own perception:  You seem okay being who you are, and your girlfriend agrees.   Instead, you appear to be upset by your own guess at what others may be thinking.  That's a trap that stresses a lot of folks out.   Consider this:  Many happy people don't mind what others think of them.   And consider this:  Many heroic characters in literature and movies are unlikeable.   (\"Colombo\" is annoying and bothersome, but we love him.   So is Johnny's Depp's Jack Sparrow and many of the roles played by George Clooney, Sandra Bullock, and Jack Nicholson. )  Would it be okay with you to be an \"antihero\" in your own life?   If you don't want to be an antihero, you have the power to be the person you want.  Your behaviours and thoughts are completely under your control.   What other people think of you is not under your control.   You are completely in the driver's seat here.   The choices are all yours.   Enjoy who you are, and use your will power to make yourself who you want to be!  "]
    },
    {"tag": " know  social anxiety? ", 
        "patterns": ["How do I know if I have social anxiety? ", "I know I can't afford a therapist so I don't know what my problem is, but I think I might have social anxiety. "],
        "responses": ["If you are noticing that anxiety tends to be triggered around interactions with others, then you may have social anxiety.  Working with a therapist, you may be able to gain insight into the nature of the anxiety, develop tools for coping with it, and take steps that may alleviate it over time, so that you can enjoy your interactions with others.     If you are short on money, there still may be options for you to be able to see a therapist. Strathmore Mental Health Facility is open for you to come and visit.  You will be cared for by our professional; counsellors.  You can also check with your insurance provider about your behavioural health coverage.   If you are not insured, some therapists and clinics will work on a sliding fee scale, and accept either low fee or may even work with you pro-bono (for free).   "]
    },
    {"tag": "Paranoia",
        "patterns": ["How can I deal with my paranoia? "],
        "responses": [" Paranoid people don't realize they are paranoid.   They believe their actions to be reasonable responses to potential threats.   From what you write, you are aware that your actions may be understood as extreme.   Instead of trying to fit your behaviour into a negative psychological category, try seeing each of the behaviours you list here, as your own uniqueness.   This way you will become more tolerant of what very well be your natural tendencies.   If you are someone who needs a lot of time in quiet, then not liking loud noises doesn't make you paranoid, it is simply the way of who you are.   One possible way of feeling better is if you would accept the answers you've developed so far for yourself.   They may be a little unusual compared to what we consider mainstream.     From what you describe, you already are dealing with what you call \"paranoia\".  "]
    },
    {"tag": "get over social anxiety",
        "patterns": ["I have not had a friend since I was 19.  I don't go anywhere, and I have no job, all because I'm afraid of people. ", "How can I get over social anxiety? "],
        "responses": ["Individual and/or group therapy can be a powerful antidote for social anxiety.  Often in therapy, the things that tend to get in the way of our securing satisfying and lasting personal relationships will appear in some way in the therapy relationship and a competent therapist will be able to help you work through this anxiety, in a sensitive way, and eventually encourage you to seek out the personal relationships that you want.  In group therapy, you have an opportunity to have a relationship not only with the therapist, but several other people who are all in the group in order to give and receive mutual support to one another.     "]
    },
    {"tag": "anxiety attacks",
        "patterns": ["What do I do when I have anxiety attacks? "],
        "responses": [" Anxiety is simply your system communicating to you that you are in danger.   You do not reason with sensory states in the body.  If your system tells you're in danger (your stomach feels like it is knots, your heart is beating out of your chest,) validate by just being present with it.  Take your breath to it.  Breathe in and out of that space.  Say ok, I am in danger.  Listen to your system, validate it like you do a child and see what happens.   ", "I will offer one  option I have been able to utilize quite successfully with those dealing with panic attacks.   Chain analysis is a fantastic way for you to map out the situation starting with the prompting event, the chain of events ((links) that lead up to the behaviour - in this case a panic attack, and then what the consequences were. ", "This is a very common question in my practice.  Panic attacks typically emerge from an underlying issue (ex.  Depression, low self-esteem, fears).  To decrease your anxiety symptoms it's recommended to seek treatment with a therapist who specializes in working with anxiety disorders and most importantly one with whom you feel comfortable with. I am trained to educate you about their anxiety and discuss building a framework with helpful tools for decreasing anxiety: 1.  Starting a daily mindfulness practice.  For example: listening to guided meditation; engaging in deep breathing exercises; yoga practice; or other positive calming activities    2.  Understand your negative and positive thoughts.  Many times we tend to focus on the potential for bad things to happen.  Increase positive self-talk when feeling down or when anxious.  For example: \"I don't need to worry, I am calm and relaxed\".     3.  Exposure to fearful or anxious situations.  This can be accomplished under the care of a mental health professional.  Many times we shy away from things that make us feel uncomfortable or insecure.  This may led to an increase in isolating behaviours resulting in difficulty in performing things we were once able to do.  For example: leaving the house; presenting in front of others; going to social events; and having conversations with people.  However, the more we expose ourselves and practice the use of our positive coping skills (ex.  deep breathing) the chances of anxiety will decrease.    I hope this was helpful.  Keep in mind, a therapist can help with guiding you through self relaxation and improvement.     ", "The are two ways that such anxiety can be dealt with.  One is an attempt to replace maladaptive thinking by examining the distorted thinking and resetting the fight-or-flight response with more reasonable, accurate ones.  As an example \"I'm scared of spiders. \" But if you change the thinking from being scared to \"I'm bigger than the spider,\" it allows the mind to reach a calmer state of mind.   Mindfulness-based therapy can also help  focus on the bodily sensations that arise when you feel anxious.  Instead of avoiding or withdrawing from these feelings, remain present and fully experience the symptoms of anxiety.  Instead of avoiding distressing thoughts, open up to them in an effort to realize and acknowledge that they are not literally true.   Although it may seem counter-intuitive, fully realizing the experience of anxiety enables the release of over identification with negative thoughts.  You can practice responding to disruptive thoughts, and letting these thoughts go. By remaining present in the body, you'll learn that the anxiety being experienced is merely a reaction to perceived threats.  By positively responding to threatening events instead of being reactive you can overcome an erroneous fight-or-flight response.  "]
    },
    {"tag": "social situations anxiety",
        "patterns": ["Why am I so anxious in social situations? ", "Whenever I have to speak in public or be in big crowds, I freak out.  I get light-headed, sweaty, and I have trouble breathing. "],
        "responses": ["Social Anxiety is normal for most when speaking in public. ome techniques to manage anxiety in these situations include practicing, deep breathing, visualization, positive self-talk, and seeking professional help if needed. "]
    },
    {"tag": "Sleeping, Anger and Anxiety",
        "patterns": ["I have a lot of issues going on right now.  First of all, I have a lot of trouble sleeping at times, while other nights I sleep too much and still feel quite tired.  I'm also noticing increased irritability and experiencing anxiety attacks that last for hours.  Is there something wrong with me and if so what should I do? "],
        "responses": [" It sounds as if you may be experiencing a bout of anxiety and/or depression.  Sleeping difficulties, irritability and anxiety attacks all are correlated with these mood disorders.  And it's actually quite common for someone to deal encounter this during their lifetime.   Also, keep in mind that just because you are experiencing this now does not mean that you will be dealing with it the rest of your life.  Many times, it can be a single episode and if treatment is received, you can help prevent any recurrent episodes.   However, you may want to first talk with your primary physician to rule out any medical issues that could be causing these problems.  There may be a reason for the sudden onset of these symptoms that can be addressed quickly.   On the other hand, if it is determined that you are experiencing anxiety and/or depression without a medical reason, there are two methods that are very helpful in your treatment:   #1 Talk therapy with a certified therapist   He/She will be able to address the concerns you're experiencing and discovering if there is an underlying issue that may be causing it.    #2 Medication   There are many medications that can assist you with the feelings that you are experiencing.  Your doctor will be able to help you find the right one that works for you.  If one doesn't work, keep trying.  There are many different options to address your specific needs.   Also, a combination of these two options is extremely beneficial!  Thank you for your question.  I sincerely hope that you feel better soon! "]
    },
    {"tag": "Anxiety,behavioural Change",
        "patterns": ["I always feel the need to tell people everything. ", "Whenever I don't tell my friends or anyone what I did or stuff that's not really important, I feel terrible, like there's a hole in my stomach.  It only goes away when I hurt myself. "],
        "responses": [" Sorry to hear of your situation.   Possibly you are overlooking that your own Self is someone worth talking to as well.   None of us are ever really alone because we are always with ourselves.   Self-talk is a major part of what guides our decisions and how we make sense of relationships and situations.     Even after telling people the stories or activities, hearing their comments, it is always within ourselves that we decide if the way we were received by these others, the comments we heard back, feel right and accurate to our lives.   I hope the feeling of a hole in your stomach would decrease by enjoying your Self.     I am guessing that hurting yourself makes the stomach hole feel less bad because the physical pain you create in yourself distracts you from feeling it.   Enjoying your Self by talking kindly, loving, and having inner dialogue may very well decrease the feeling of a hole, altogether.   Sending lots of good luck! ", " I feel strongly that the help of a professional therapist is important here.  Feelings are never wrong, but it can help to understand where they come from and talk to someone who can teach you healthy ways to cope.  Self-harm is not the answer to managing those emotions you feel in your stomach.  Although I'm glad you said something here, a professional would need to spend some time with you and get a deep understanding of your life in order to help you sort all these reactions out effectively.  I hope you reach out to someone soon.   "]
    },
    {"tag": "throw stuff",
        "patterns": ["Why do I throw all my stuff away? ", "I constantly have this urge to throw away all my stuff.  It's constantly on my mind and makes me feel anxious.  ", "I don't sleep because I'm thinking about something I can get rid of.  I don't know why I do it.  "],
        "responses": ["Play in your mind with the metaphor of \"throwing away\" and whatever associations you feel toward this.   Are you feeling alarmed or freed, by throwing away things?   I'm only suggesting these, not telling you that they apply necessarily.   Anxiety comes up when people feel helpless to manage a meaningful part of their lives.   So pay attention whether your stuff represents difficult scenarios or phases of your growing up years.    Possibly you are trying to rid yourself of painful feelings which were part of your early years' relationship with either parent.   Basically, sounds as though you are trying to establish a clearer sense of who you are and the throwing away part is a means of discovering who you are, once all the clutter is released.  "]
    },
    {"tag": "Anxiety, hearing",
        "patterns": ["When I'm around people, I sometimes think someone has made a comment to me or asked me to do something.  I will be focusing on something else and then randomly think I hear something about me.  I never know if it was actually said. ", "Can anxiety make me think I heard something about me? "],
        "responses": [" It sounds like you are having difficulty knowing if people are saying things to you, or if you only thought someone was talking to you, and this is anxiety producing.  It's understandable that it could be confusing and/or a bit scary to be unsure if people are speaking to you or not.  It's hard to say exactly what is going on from just this description, but if you can work with a competent therapist, you may be able to get more insight into what is happening, get clarity about your social interactions, and develop some ways to deal with the anxiety.   "]
    },
    {"tag": "Anxiety,Career counselling",
        "patterns": ["I keep on changing my life when things get tough. "],
        "responses": [" I recommend that you make a list of all the reasons you should change your life and all of the reasons you shouldn't change your life.  Can the problem you are in be fixed?  Is there others you can lean on for support?  Are there other people you know who have been through a similar experience and are willing to share their story with you?  It is important to rely on your support network to help you get multiple points of view.  If you believe you need additional help, I suggest seeing a professional.  "]
    },
    {"tag":"anxiety",
        "patterns":["I think I have anxiety", "What is anxiety? ", "Tell me about anxiety", "Can I have some information about anxiety? ", "How do I support a loved one with anxiety? ", "How do I fix my anxiety? "],
        "responses":["I see that you want to learn more about anxiety, and how to support yourself or your loved ones.  At the highest level, anxiety is your body's natural response to stress.  It's a feeling of fear or apprehension about what's to come.  The first day of school, going to a job interview, or giving a speech may cause most people to feel fearful and nervous.  We all get anxious sometimes, but anxiety becomes a problem when it starts affecting your daily life drastically.  The best thing that you can do to help reduce anxiety is to take a few deep breaths and talk to someone about what you're feeling.  Some natural remedies that you can try include: getting enough sleep meditating, staying active and exercising, eating a healthy diet, staying active and working out, avoiding alcohol, avoiding caffeine, and quitting smoking cigarettes.  Support your friends and loved ones by checking up on them and just listening.  Whatever you're feeling is valid. "]
    },
    {"tag":"Bipolar",
        "patterns":["How do I know if I have bipolar disorder? ", "I feel that I am struggling with undiagnosed bipolar disorder, and it is making my day-to-day life extremely difficult. ", ""],
        "responses":["It sounds like you are experiencing a great deal of distress and you're wondering if it may meet a diagnosis of Bipolar disorder.  There are a few different types of Bipolar diagnoses in the DSM (diagnositc and statistical manual) and the best way to find out if your experiences would meet that diagnosis would be to meet with a mental health professional.  You can also look up the diagnosis online and see if what you are going through meets the criteria. One question that I would have for you is, what would it mean for you to find out that you meet the criteria for such a diagnosis?  It sounds like whether or not you do, you are suffering and working with a therapist may help you get into a better place. "]
    },
    {"tag": "behavioural Change",
        "patterns": ["I have a compulsion to fill in holes in my skin with ink. "],
        "responses": ["Hi, The fact that you're concerned says a lot.  If I was your therapist I'd ask you questions about your worries and how this is causing a problem in your life.  You're causing perhaps permanent changes (damage? ) to your body, and it's likely you're trying to express something. . . pain maybe?  A therapist can help you to explore what's going on for you and how to get your needs for self-expression met in a more healthy way.  Good luck!"]
    },
    {"tag": "pathological liar",
        "patterns": ["Is my ex-boyfriend a pathological liar? I have an ex-boyfriend who just lies about everything.  He is super lazy.  He lies to everyone that he has a good job, builds trust, and then start borrowing money and large amounts too.  It has come to the point where he has gone through several group of friends.  He is leaving a trail behind full of friends in debt because he would put on a sob story, borrow money, then disappear.  He refuses to work, so he sits at home playing games all day and either lies to his mom for money or lies to his friends.  I used to think his lying was due to his drug habit, but now I'm hearing from other ex-friends of his that this started even before the drugs got into his life.  He would borrow anywhere from $5,000 to $50,000 from everyone and it would all disappear.  He's in debt with bills.  He doesn't gamble, but he spends his money on random stuff. "],
        "responses": ["It sounds like you have some ambivalent feelings towards your ex-boyfriend that are difficult to sort out.  You notice that there are both desirable and undesirable things about him, and this is true of everyone to one degree or another.  One question that I would have for you is, are you satisfied with your relationship with him as it currently stands?  Are you happy with the boundaries between the two of you, or would you like them to be different?  Negotiating through conflict and establishing different boundaries are definitely things you could work on with the help of a therapist.  Another question I would have for you is, what would it mean for you to find out what motivates his behaviour?  Discovering the roots of such behaviour is something that he would have to work on in his own therapy and not something that you and a therapist could discover without him. "]
    },
    {"tag": "Lazy",
        "patterns": ["How can I get rid of my laziness? ", "I am lazy.  I am very aware of the problem and try to talk myself out of it all the time, but I never seem to shake the habits.  I try to think of what it is doing to me and my future, but no matter what, I keep creating excuses for myself to continue the procrastination.  All I'm ever left with is regrets and a low grade.  I am at an all-time low in my life, and I'm not even that old.  I've always been a straight-A student, but now I'm getting C's and F's, and it hurts me to know that I am way better than that.  It's not even like the work is hard. "],
        "responses": [" Possibly laziness is not the true problem and is only what appears as the problem.  Since you describe your laziness as an observable quality, I assume you've not always felt or handled yourself this way.   Quite possibly and more likely, the particular conditions of your current life are not ones that are optimal for feeling good about yourself and your involvements.   One suggestion is to see if there is any purpose to what you're doing in all the areas in which you see yourself acting from laziness. If you're not able to notice any good purpose, then you may be mistaking 'laziness' for a significant amount of stress in your lifeStress can be opened and understood.  If stress is what underlies what appears as laziness, then you define the contributors to your stress.  Not feeling enough support in your life, financial uncertainty, arguments with people who are close in your life, feeling misunderstood overall or by particular people, all are possibilities.   Good luck in learning more about who you are! ", "I am sorry to hear that you are going through such a tough time.  It sounds to me like you are suffering from depression to some degree.  Have you seen a therapist or talked to anyone about your problems?  If not, I would advise that you do so sooner than later so that you can learn what is causing you to be unmotivated and causing difficulty with breaking the cycle that you are in.  It is also a good idea to get a medical evaluation from your doctor to rule out any medical causes for your current condition.  Most often, difficult situations that life throws at us, along with an inability to think positively, and break bad habits are what cause depression.  Some things you can do immediately are seek help from a professional, schedule in time every day to engage in pleasurable (or once pleasurable) activities, exercise daily, and practice thinking more positively.  Set a few daily goals for yourself and write them down each morning or the night before.  Achieving your goals every day will give you a sense of accomplishment and can lead to feeling more optimistic and capable.  Additionally, keep a journal to write down how you are feeling and what ideas you have to help feel better.  Sometimes having these ideas written down make it more real and tangible.  Know that depression is most often curable but takes work and a desire to change (which you clearly have).  Once you start feeling better about yourself and your life, your grades should naturally begin to improve, as you will have more motivation and energy to focus on that particular area.  Best of luck to you!"]
    },
    {"tag": "always emotional",
        "patterns": ["How can I stop being so emotional all the time over worthless stuff? ", ""],
        "responses": [" Hello, It's really common for people to become very upset over small things sometimes.  The small thing is a \"trigger\", and the emotions aren't so much about that event that's happening in the present; they are more connected to old events that evoked the same feeling.  You've likely had too much of that feeling in your life and you've developed a sensitivity to it.  Look at the small events that are triggers for you and ask yourself what same or similar emotion they evoke.  If there's anger there, look underneath that.  Is it powerlessness, worthlessness, hurt, shame. . . ?   Then ask yourself when in your life you've experienced TOO much of that feeling.  As a child, maybe, but not necessarily.  That's the first step, and combined with empathy, compassion and self-esteem, you're starting to build what I call an emotional air conditioner.  A good therapist can help you with the rest of this process and with learning ways of coping with emotions daily.  I wish you the best.  "]
    },
    {"tag": "death thoughts",
        "patterns": ["Why do I think about death? ", "I noticed lately that I've been thinking a lot about death.  I don't want to die, and I'm not suicidal.  I just think about what would happen if I died or if someone I loved died.  I imagine how sad everyone I know would be.  I know it isn't worth it, and I definitely want to live and have a future.  I just think about it.  When I'm driving, I sometimes imagine what would happen if I just let go of the wheel and kept going. "],
        "responses": [" I'll respond to your speculation that if you let go of the steering wheel while driving, you'll end up quite seriously hurt, at the very least.    It is fine to play in your mind with 'what ifs'.   People who write horror movie scripts most likely have some terrible sounding stories and suppositions.   If you trust yourself to actually not follow through with an idea that may kill you, and you recognize the difference between thinking dangerous things and doing dangerous things, then go to the next step of understanding more about your thoughts on death.   Since you wonder about being missed if you die, it is possible your thoughts about death are from feeling that you are metaphysically dead to people in your life whom you wish would show more interest in you.   Play around with your idea as to why you'd consider how people will feel about you if you're not in their lives.   This may offer some insight as to your expectations of current relationships with others.  "]
    },
    {"tag": "breakdows",
        "patterns": ["I've been having breakdowns for no reason at all. ", "I start to think of an issue that doesn't even matter or something bad that happened years ago.  Then, I cry, pull at my hair, plug my ears, hit myself, and throw things.  In loud public places, I get on edge and start being sarcastic and moody.  I have an awful fear of people leaving me (which normally ends up happening) and I feel like I'm too clingy. "],
        "responses": [" There is a reason you are having breakdowns.  I can't agree that they happen for 'no reason at all'.   Finding out the reason is going to be your biggest challenge because that may require you to dig deep into your past, uncover hurtful experiences, or recognize something that would be extremely pain.  However, if you don't find professional help to carefully guide you through whatever you may confront, the symptoms mentioned will continue and may even get worse.   There is a light at the end of the road but you need some help to find the right road to get on so you can see it.   "]
    },
    {"tag": "signs of psychosis",
        "patterns": ["What are some physical signs of psychosis? ", "I just need to know if I'm really crazy or not. "],
        "responses": [" Do an internet research on psychosis symptoms and see if you have several of the symptoms.   If you do, seek a medical evaluation from your primary care physician.  There are great medications and psychotherapy that can help you live your life to the fullest.  There a many people who are diagnosed with psychosis and living a productive life "]
    },
    {"tag": "Deal with OCD",
        "patterns": ["How do I deal with OCD? "],
        "responses": ["Obsessive Compulsive Disorder can be similar to anxiety disorders, assuming that you have already been diagnosed with OCD, it is important that you learn to identify the symptoms, the triggers and how to manage them. Different types of treatment have proven successful, among them Cognitive behavioural therapy can help you to understand the source and thought patterns that cause the behaviour.  Exposure therapy could help you to manage the obsession by interacting with the objects that are the source of obsession.  Other creative therapy techniques may help you to manage symptoms and help you to relax when triggered. "]
    },
    {"tag": "behavioural Change,Anxiety",
        "patterns": ["Why do I feel like I'm watching my life from a window? ", "I never feel like myself.  I can't even think straight anymore.  I start stuttering and I can't remember anything.  I always get nervous and usually talk myself down but recently end up fighting with, what feels like, someone else.  I don't know why I feel this way, but I hate it. "],
        "responses": ["What you are describing sounds like it may be a form of dissociation.  Dissociation is our mind's way of disconnecting us from aspects of our experience in an attempt to protect us in overwhelming situations.  It also sounds like you are noticing anxiety in certain situations.  In working with a competent therapist, you may be able to gain insight into these experiences, learn skills for coping with anxiety and reconnecting with yourself, and alleviate these symptoms over time", "Hi, Okay, something's definitely going on, right?  My gut is to start with your family physician, because you have some physical symptoms.  While it seems anxiety is a likely problem here, your doctor will hopefully know your history and can help you decide if you need some medical tests or some therapy.  Without knowing more, that's all I can say at this point. However, If you don't have a personal doctor you can visit us at the strathmore medical centre for a pysician to assist you.  Best of luck. "]
    },
    {"tag": "behavioural Change,Depression",
        "patterns": ["I have voices in my head.  They don't go away, and I feel like I'm going crazy.  Does that ever stop?  Can it be a symptom of medication? "],
        "responses": ["This can certainly be a side effect of some medications.  If the voices are so powerful that you can not sleep or they are constantly present, you shouldn't wait any time, but go and see your doctor straight away. ", "Since you realize that hearing voices in your head is not usual for you, then definitely there is a problematic situation happening within your awareness of who you are.  if you recently started taking a new drug or increased dosage of one you already were taking, and the voices started shortly after, then yes, it is possible medication created your problem.  Start by telling whoever gave you the presecription, about the problem you're having.   'Crazy' has some flexibility as to whether someone is this way or not.  Certainly a very positive sign that you're not crazy, is that you're self-aware of a problem within yourself.  And, you're responsible toward yourself and making effort to address this problem.  Crazy people usually don't do responsible behaviours.  "]
    },
    {"tag": "behavioural Change,Social Relationships",
        "patterns": ["I am extremely possessive in my relationships and this is hurting my friendships.  How can I fix my underlying issues? "],
        "responses": ["Hi there.  It's great you are able to realize there are other issues going on with someone who feels possessive.  At the root of it is fear.  Fear of losing someone, fear of being alone, fear of not being good enough.  All those fears can lead to low self-esteem and feeling like you have to control other people so you don't lose them.  The thing is, controlling other people only pushes them away.  Vicious circle, right?  What I would suggest is some cognitive therapy to change those underlying ways of thinking.  You can start with this assignment.  Write down all the things you think about yourself, positive and not-so-positive.  Then rewrite those not-so-positive things so they are positive.  For example, thinking something like,  I'm too pushy,  can be rewritten as I'm assertive and I go after what I want.  It can be hard to do since we tend to get  stuckin our negative ways of thinking about ourselves.  If you have someone you trust, you can ask for their help as well since most likely they see you differently than you see yourself.  Finding a good cognitive therapist can help you further, but if that's not an option for you right now, there are lots of self-help books and websites that are out there.  You've already taken the first step, so keep moving forward.  "]
    },
    {"tag": "Career counselling,Professional Ethics",
        "patterns": ["I just wanted to get to know one so I can hear about their college experience and the courses they took.  I also wanted to know if they enjoy their job and how long they were in school. ", "I'm in high school, and I want to be a psychologist. "],
        "responses": ["It's a great idea for you to reach out to find a psychologist to talk to if this is a field you might be interested in pursuing.  Regarding the length of schooling, it generally takes 4 years of college and an additional 4 to 7 years of graduate school to earn a doctorate degree to become a psychologist.  There are also other similar professions, including counselling that don't require a doctorate degree.  Licensed counsellors generally completed 4 years of college and an additional 2 years of graduate school.  If you are thinking about a career in psychology, the local APA chapter would be a good place to start to find a local psychologist to talk to.  Here's a link to the NJ APA chapter: https://www.psychologynj.org/"]
    },
    {"tag": "need talk to someone",
        "patterns": ["I'm in a state of depression right now.  Who can I talk to?  I've been sick in a lot of pain and crying.  Don't know where to turn. "],
        "responses": [" I'm sorry to hear that you are feeling as if you're in a slump.  First of all, nothing is wrong with you.  Many people report similar symptoms.  Have you ever talked with a physician regarding your symptoms?  Two extreme emotions such as feeling extremely happy and then feeling extremely low for a length of time may indicate a mood disorder.  I think it would be best to talk with your doctor or a therapist to help pinpoint the issue causing them.  It's possible that it could just be certain stressors in your life that are causing the two extremities but you definitely want to rule out any mental health issues.  If it is in fact mental health related there are many medications or therapy choices that can help.  Thanks for reaching out! I hope that you will feel back on track soon! "]
    },
    {"tag": "studying abroad",
        "patterns": ["I'm studying abroad, and I'm depressed. ", "I'm supposed to stay here the rest of my academic life, but I've never liked it here, not even before I came.  I've never felt like I belong, I've missed my country every second in the past four months, and I'm just miserable.  I'm gaining weight, doing nothing, and crying for hours straight.  Is it time to go back home or is it just culture shock? "],
        "responses": ["It sounds like you are feeling very unsure and out of place and the prospect of continuing to feel as you do now for the remainder of schooling seems daunting.  Without getting to know more about you and your experiences here and at home, it is hard to say what you should do, however, I think exploring these things with a competent therapist may help you to discover the answer. "]
    },
    {"tag": "I'm overwhelmed and depressed",
        "patterns": ["I'm unemployed just relocated.  I can't get approved for a place to live because of past mistakes which follow me to this day.  I'm depressed and on the verge of loosing my partner because I'm overwhelmed and have trouble functioning on a daily basis.  I see no light at the end of this tunnel and need some help.  I see no point in this chaos infested joke some call life. "],
        "responses": ["It sounds like you are feeling like things are hopeless and out of control and you're not sure what to do about it.  If you can find a competent therapist to work with, together you may be able to come up with some strategies for alleviating the overwhelming distress that you are experiencing and gain some insight into what may be contributing to these challenges.  Additionally, a therapist may be able to support you in getting back on your feet in regards to work, a place to live, and showing up with your partner in a way that will be more satisfying to you. "]
    },
    {"tag":" think about death all the time",
        "patterns":["I think about death all the time because I feel so alone.  I want someone to love and someone to love me. "],
        "responses":["Feeling alone and/or isolated is almost always associated with being depressed.  As humans, we need connection and interaction with others in order to feel satisfied.  Given that you are frequently thinking about death, I highly recommend that you see a mental health professional as soon as possible to help assess your immediate needs and address any underlying issues that may be contributing to your feelings of loneliness and depression.  The good news is that with proper, consistent treatment and commitment to change, things can really turn around for you.  A therapist can work with you on building enjoyable activities into your daily routine, change maladaptive thought patterns that contribute to your sadness, and help with exploring what has gotten you to where you are.  By learning about where your sadness originates, engaging in preferred activities, and changing your thought patterns, you should begin feeling relief from the burden of depression.  What will likely result, is further opportunity to find social outlets and an increased ability to connect with others.  Don't give up.  Create some short terms goals that you can likely achieve and make your treatment a priority and a focus.  You have already taken the first step in getting better by writing to this site.  Keep on this path and believe in yourself.  Best of luck to you! ", "Hi,I'm so glad you reached out.  I urge you to talk to someone close to you, today, about your feelings, and to also seek professional help for your serious thoughts and feelings.  We want you to be safe, and your depression is treatableLoneliness is so painful, and when we feel lonely, this can lead to fears that we are not worthy of love or that the world is just a cold and lonely place.  Neither are truths; only thoughts.  Once we have fears like this though, we start to pull away from people, the fears keep us isolated, which makes the thoughts worse, and the cycle continues. We all have a place in this world.  We all have value, we all deserve love, and there are safe, wonderful people out there waiting to meet you and care for you. Can you take a moment right now to become more in touch with three things?  First, who in your life, if they were sitting beside you right now, would say 'wait a minute. . . I love you!' What is the evidence that you are already cared about?  Then ask yourself 'what is the evidence that I am lovable? ' What qualities do you have that make you a good friend or person?  The third question is 'what tells you the world is a good place? ' What evidence do you see that there are people out there who care about others?  Please reach out to someone today as you ask yourself those questions.  I wish you the best. "]
    },
    {"tag":"Crave depression",
        "patterns":["Why do I crave depression? ", "It's not entirely true to say I enjoy being sad, but I always find a way to feel that way.  I listen to sad music, read tragic stories, and, in a twisted way, like how bad it makes me feel.  I focus on negative aspects of my life even if they aren't legitimate or I just make it seem negative. "],
        "responses":["It sounds like you are noticing that you are drawn towards sad and negative content and it's hard to understand why.  This may sound counter-intuitive, but sometimes we do things that on the surface may look problematic (or even cause us some real problems) because it serves us in some unseen way.  A simple example would be somebody who is addicted to a substance; their addiction may be causing serious problems in their life, and they may even know it, but the addiction serves them by helping them to avoid painful feelings that they anticipate having if they quit using.  Now I am not saying that what you describe is an addiction, it is just a really illustrative example of the unseen benefit.  One thing I would be wondering about is what is the unseen benefit of seeking out sad and negative content?  I'd also be wondering what your relationship is to other feelings.  These are things you may benefit from exploring with a competent therapist.  "]
    },
    {"tag":"Should I go back on my medicine? ",
        "patterns":["I have experienced cycles of depression for the past four years, and it hits me harder every time it comes back.  This past time, it was extremely debilitating, so I went on Wellbutrin.  I could feel the effects of the medicine after the first week.  A month and a half later, I decided that my depression was being caused by my own unwillingness to move forward and address my behaviours and thoughts that were keeping me in a place of despair.  I became worried that the medicine was making me complacent and prohibiting me from working out what I needed to in my life to bring back true fulfillment.  I stopped taking it a month ago and feel okay; a lot of the anxiety it was paired with has gone away.  However, I still don't feel my sense of self has been completely regained, and I have days where I feel a zombie-like haze of having no interests or the ability to fully concentrate on anything.  Is it better to continue letting time and good habits work out the remaining depression or should I go back on the medicine? "],
        "responses":["Deciding whether or not psychiatric medicine is a good option can be complicated, as you have noticed, and only a person who is licensed to prescribe can give you medical advice regarding medications.  While there is sometimes relief from symptoms from medication, as you have pointed out, there are often negative side effects as well.  While I can't give you advice on whether or not to continue medication, I would urge you to take an inventory of the positive and negative effects that you have noticed and educate yourself as much as possible about the short and long-term costs and benefits of psychiatric medication.  If you can find a doctor, psychiatrist, or ARNP who is competent in mental health, it may also benefit you to consult with them.  One thing that I am wondering about is, what is your support system like, in regards to your fight against depression?  Are you seeing a therapist or attending any therapeutic or supportive group?  While there are many things that one can do on their own to work through challenges such as depression, psychotherapy has been shown time and again in research to be highly effective and sometimes having a relationship with a caring, competent professional who understands depression and ways of helping can make a huge difference.  "]
    },
    {"tag":"How do I know if I have depression?  ",
        "patterns":["I'm almost never happy.  Half of the time, I don't feel anything.  I find it easy to make myself feel nothing.  I know I push people away because it's easier.  I just want answers.  I'm sick of feeling this way.  It's ruining my relationships with people. "],
        "responses":["Maybe you have depression The name of your condition matters much less than the descriptions you wrote of how you feel Since you've observed how you sometimes interact with people and realize you aren't happy with the result, you've a very solid starting point for reflecting on your deeper wishes in relating to others.  Start with asking reasons of yourself about the puzzling aspects of how you're-engaging with others.  Theorizing as to 'why' you feel that pushing people away is 'easier', and easier than what?  Googling the keywords of how you feel, may open a starting point for ideas on knowing yourself and what you wish for.  ", "Hi, This is a common question.  I suggest that you not diagnose yourself (only a physician can do that), but the symptoms you mention are certainly common signs of depression; rarely happy, emotional numbness, hopelessness, isolation.  Depression is very common.  Research suggests that one in three people may experience it in their lifetime and at any one point, ten percent of adults may be experiencing it.   Most therapists are very good at spotting the signs and treating accordingly, although only a physician can prescribe medication. The great news is that depression is treatable.  Some people experiencing depression may benefit from medication (often to lift the heaviness of the illness enough so that one can focus on psychotherapy), and therapies such as cognitive behavioural therapy and behavioural activation therapy have demonstrated a clear ability to reduce symptoms of depression.  Even if medication helps, seeing a therapist to look at the roots of your depression and to build coping skills is very important.  A qualified therapist will help you look at the barriers to happiness in your specific case and suggest a course of treatment.  You are not alone, and you don't have to suffer.  Keep asking questions and you will find your answers! "]
    },
    {"tag":"How do I get rid of depression? ",
        "patterns":["I've been feeling worthless, unaccomplished, and so frustrated.  I want to break things, hit myself, run away, kick, scream, and cry.  I just want to be happy and outgoing again.  I want to be able to take care of my daughter and live comfortably. "],
        "responses":["There is help out there.  For your daughter's sake, start somewhere.  Feelings are only that; your worst fears about who you are are only based on a few moments that haven't gone well.  Depression is so treatable, but you have to seek treatment from a professional.  Here's a quick exercise for you to do that can show you how therapy might work. . .  fear is telling you the worst possible story of your life, right?  So. . .  if there was an  opposite  story. . . the very best  story that someone could tell about you and your life. . . what would that be?  Who would be telling it?  Someone who loves you?  Someone who was around you when you were that outgoing person?  Someone who's been watching your life from the start?  God?  Write that best story.  I dare you to give it as much credibility as the worst one.  Therapy is often about helping people reject their 'worst stories'.  I invite you to start exploring with a qualified therapist whatever barriers stand between you and your best life.  I hope you reach out soon.  :) "]
    },
    {"tag":"feeling empty while young",
        "patterns":["My life is completely normal, yet I feel empty inside.  I feel as if I already know why I'm alive: to reproduce and die. ", "How can I feel so empty even though I'm only in my early teens? "],
        "responses":[" Are there any times or moments in which you feel other than 'empty'?   Start with knowing the context of when you feel something other than empty.  If there is no recent example, then in your mind, go back in time to think of when you felt something other than empty.  Recall what you liked about this time, whether you were by yourself or with others, what type of activity you were involved at the time of non-emptiness.  How did you come to your conclusion that your life purpose is to reproduce and die?   If this is what your parents, siblings and extended family believe, it is possible that you have a broader view of yourself and haven't yet uncovered a way of defining your own philosophy of living.  Give yourself the time to browse around online, or in person social meet ups, on your interests.  It is possible you will discover entire new areas of life and ways of considering life, that are brand new to you and which connect to your true self.  This is one way of respecting your individuality, which of itself, may decrease your sense of emptiness.  "]
    },
    {"tag":"being called names",
        "patterns":["People have been calling me names, and I have had enough of it.  I cannot stand it anymore I'm done.  I have told someone this, and that is why I am writing this.  The thoughts are awful. "],
        "responses":["It's sounds like you are feeling pretty overwhelmed with intrusive thoughts and are feeling very criticized by others as well.  I think it is great that you are reaching out and I can tell that you want this to change.  Working with a competent therapist may be a good option for getting some more clarity about what is going on, developing ways to cope, and eventually getting relief from these overwhelming experiences. "]
    },
    {"tag":"Is this depression? ",
        "patterns":["I feel like I am internally screaming all the time.  Externally, I am calm, but I have this intense, unidentifiable emotion constantly.  I don't feel sad.  I don't cry a lot.  I feel rather emotionally distant other than the internal screaming.  It kind of feels like I'm a caged animal. "],
        "responses":["It is hard to make a definite diagnosis however I would say that it could be and or a combination of depression, stress, PTSD, etc.  More background information would have to be needed.   One thing I would say is that you really need to seek guidance from a professional to work through these symptoms.  If what you described as a caged animal is released, all the crying, sadness, and controllable emotions will come out.   That would not be good when they do.   Get help before they do. . ", "As far as the formal diagnosis of depression goes, it would be hard to determine without more information.  It sounds like you are noticing that there is a significant difference between how you are feeling on the inside and how you express yourself outwardly.  Part of you is quite distressed and yet it remains invisible to the outside world, almost as if it is trapped inside of your body.  Many people who are depressed experience such things as intrusive thoughts, emotional numbness, difficulty expressing themselves, and bodily tension (caged animal? ).  In working with a competent therapist, you may be able to get more insight into what you are going through, the nature of the disconnect between you inner feelings and outer expression, and eventually gain relief from the distress as well as a greater sense of connection with yourself and personal freedom.  "]
    },
    {"tag":"love myself",
        "patterns":["How can I love myself? ", " I hated myself and still do.  I just need help.  I need someone to care for me.  I need someone to show that they care. "],
        "responses":["I agree; you need more care and support.  No one deserves to feel alone, or like they hate themselves.  We're all wonderful, imperfect, complicated people and we're at our best when we're all helping each other.  I'm glad you wrote this question, because a lot of people have this feeling sometimes.  I can tell that you're smart, because you seem to sense that the two things you wrote about are connected. . . you \"not being yourself\".  At one time you needed and deserved extra love and support, but the people around you didn't seem to give it to you, maybe.  My hunch is that they wanted to, but that they didn't know how much you needed it, or what you needed exactly.  The older you get, the more you will have to take charge of letting people know what you need.  Maybe this is one of the suckier parts of being mature, but that's how it works.   It sounds like fear tricked you into thinking people wouldn't like you.  Fear can be silly.  So then, fear got you to not show yourself, and when we don't show ourselves, people can't see who we are; they don't know us as well and then they don't know what we need and they can't care for us as well either.  Fear of not being liked isolated you from the people who love you.  It does that to a lot of us.  So, where you're at right now is because of what fear did to you.  There's a simple solution, but you'd have to be brave enough to look fear in the face and say \"Get off my back!\".  \"You're not helping me by telling me lies. \" Can you be brave enough to go back to your old, louder, self?  If you talk to the people closest to you. . . tell them what you think and how you feel, then they'll be able to give you the care that you want and deserve.  I wish you well as you try this!"]
    },
    {"tag":"Overweight",
        "patterns":["I'm depressed because I want to lose weight. ", "I feel like I am overweight"],
        "responses":["Our culture sets a very high standard on being within range of what is considered \"normal\" weight, that probably more people than you imagine, have faced a similar feeling of not living up to standards of how much to weigh.  Are you actually too heavy for your height and bone structure?  First be sure you're depressed about an actual weight problem and not due to failing a cultural standard that is difficult for most people to reach.  If you truly weigh more than is healthy, then figure out the reason for being depressed about losing weight.  Were you criticized by your parents when young, for all sorts of things, especially appearance?  Do you associate too much weight with self-criticism, sense of failure?  Your question here is very brief so I'm only guessing the possible areas, based on typical ideas people often have about themselves and weight.  Basically, if you view weight loss as a method of self-care, go slow and steady with it, you'll find your way! ", " Start taking control of your life.   Take small steps by making small changes to your eating and exercise each day.   For example, drink one extra glass of water,  take one flight of stairs, park farther away from store. . .   Some changes help you take control of your depression by changing it to motivation. ", "Depression is when you know what you need to do but are not doing it.  The depression is telling you that are ready to accept who you are.  Weight is traditionally an issue of protection and not feeling safe which in and of itself can add to the depression.  This process is simple but is challenging to explain or walk someone through on social media.  If there is one suggestion I would make it is to start living now, go do what you would do if you had lost the weight.  Don't hold yourself back.  Little shifts can help you start to make different choices.   When you do these little shifts they create big shifts.  Of course adding Yoga, and Meditation is very helpful in weight loss.  At our facility we have both of these as well as nutrition counselling using a wholistic approach.  "]
    },
    {"tag":"Depression,Anxiety",
        "patterns":["Can a mental breakdown last 10-15 minutes? "],
        "responses":["I'm not quite sure what you're asking, because you don't define 'breakdown'.  We all fall apart in little ways, and then we get to put ourselves back together however we want.  Feelings come and go, and they pass through us more quickly if we have coping skills and healthy thought processes.  If you're concerned about some intense periods of despair or you feel like you don't have those coping skills, a bit of work with a therapist can help you. "]
    },
    {"tag":"scared of doctor",
        "patterns":["I'm scared to go to a doctor or take anti-depressants. ", "A friend of mine taking psychology advised I go to my doctor to check if I have major depressive disorder.  I'm afraid of the consequences of doing so.  If I do become diagnosed with major depressive disorder, won't that go on my records?  I will never be able to become a counsellor along with a list of other things I may be prohibited from.  I'm also afraid of taking any anti-depressants.  This year, my doctor gave me some for a 'dislocated hip. ' I had a severe reaction and passed out moments after taking them.  Everyone I know who has taken anti-depressants says it's a bad idea all around and yo'm not really suicidal, but I am not really taking care of myself either.  Someone also told me they still use electroshock therapy.  I'm not keen on that.  I'm wondering if I am better off just getting self-help and working things out on my own.  It's just that I've been an emotional mess since I was in elementary school.  I've graduated now and tried to stay positive and be happy, but I cannot deny I still am not good. "],
        "responses":["Questioning mainstream thinking and being in touch with your own views, are signs of strength and clarity in a personI would advice you to avoid anti-depressants.  Their effectiveness is in suppressing a person's mood and feelings.   If someone does not know how they are feeling, then they will have more difficulty in understanding themselves, their uncertainties and hesitations, and overall, how they relate to others and what they expect from others.  Anti-depressants mask how someone feels.  In a crisis, temporarily taking anti-depressants may be helpful.   If someone is so overwhelmed that they are not functioning, then suppressing unhappy feelings so that the person can get through a day, may be of benefit for a short while Basically, respect and follow your own opinion about anti-depressants.    Your view is shared by many.   It is a minority opinion, and very valid.  If you would like to shop for a therapist, ask the person on the phone, what their opinions are about anti-depressants.   Ideally, you will eventually find a therapist who thinks in a way which is similar to you, or at least similar enough that you will have a sense that you are able to trust working with them on whatever you define as problematic.  I hope you will have an easy and productive therapist search! "]
    },
    {
        "tag": "broke but need help",
        "patterns": [
            "What can I do if I need to talk to someone but I have no money?"
        ],
        "responses": [
            "You can visit some of the following stations for free mental health services: (1)Lang'ata Health Centre: physiotherapy and counselling (on Tuesdays).    (2)Kibera AMREF Health Centre: counselling (on Wednesdays) (3)Lunga Lunga Health Centre: psychiatric clinic and counselling (on Tuesdays and Thursdays) (4) Mathare North Health Centre: psychiatric counselling and community mental health (on Tuesdays) "
        ]
    },
    {
        "tag": "Depression,Anxiety,behavioural Change",
        "patterns": [
            "I think I have anxiety and depression. It has manifested an extreme distrust for others. "
        ],
        "responses": [
            "Your feelings of distrust are the natural outcome of not being properly heard and understood.  Friend's not willing to listen to you, so of course you're frustrated and this frustration comes out in all sorts of uneasy feelings. Willingness to hear each other in a non-defensive way, sometimes requires a therapist's assistance. Ask your friend if they are willing to understand, not judge you. Be willing yourself to do the same."
        ]
    },
    {
        "tag": "Depression,Anxiety,Relationships",
        "patterns": [
            "How do you deal with mental illness (depression, anxiety) in a relationship? "
        ],
        "responses": [
            "I understand that mental illness can have a significant impact on relationships. Understanding your own and one another's triggers are the key to building a successful relationship."
        ]
    },
    {
        "tag": "Relationship Anxiety  ",
        "patterns": [
            "Relationships cause me anxiety and nausea. "
        ],
        "responses": [
            "Maybe take a moment and listen to anxiety. Anxiety tends to try to convince us that something's wrong with us or something bad's going to happen. Anxiety sometimes prefers to stay vague, but you can try to clarify it's whisperings by asking yourself these questions: What am I afraid of?, What is the worst thing that might happen here?, Then what might happen, and what would be the worst part of that?  Keep going until you find the very worst thing that might happen?  Might someone not want you, might you feel rejected, or feel not good enough, will you get hurt?  Then when you find that core fear, you can look at your life and I bet you'd find a place where that idea or fear originated.  A big moment (or many smaller ones) when you actually did feel or get rejected or abandoned or hurt.  In the end, it's a feeling you're trying to avoid (not life or relationship), and anxiety is trying to help you avoid it by making you overcautious. But if this doesn't work for you, get help from a qualified therapist, you can learn to talk back to anxiety and move forward in life and love with calm confidence."
        ]
    },
    {
        "tag": "Depression,Family Conflict",
        "patterns": [
            "How do I deal with parental figures who have hurt me? ",
            "How do I deal with a mother who have hurt me? ",
            "How do I deal with father who have hurt me? "
        ],
        "responses": [
            "It sounds like you have been thinking about how past hurts have influenced you, and when you try to talk about these hurts with people in your life, you are feeling invalidated. It also sounds like current conflicts are continuing to leave you feeling hurt and under valued. In working with a therapist, you may be able to get some clarity about your past, who you are, and what kinds of boundaries you want in your relationships, so that you can lead a life that is more satisfying to you."
        ]
    },
    {
        "tag": "Depression,Marriage",
        "patterns": [
            "I'm going through depression right now and my relationship is suffering"
        ],
        "responses": [
            " Hi there.  Thank you reaching out for help. It takes a lot of courage for someone that is being abused to reach out for help. I want you to know that I am here to help you in any way that I can. First question is I hope both of you are safe and sound. I know it might be hard to communicate right now. My advice is for both of you to take time out and calm down and meditate on whats best. It can be healthy if you see a counsellor for help. Here is our number in case you might need someone to talk to (+254)(0)730-734300"
        ]
    },
    {
        "tag": "Depression,Relationships",
        "patterns": [
            "How do I make myself happy without someone who made me happy? "
        ],
        "responses": [
            "It sounds like you have been feeling pretty down, since the loss of a relationship, and you're wondering how to be happy by yourself. Intimacy is a very natural human desire and at the same time learning to enjoy ourselves, even when we are alone, can strengthen our ability to lead a satisfying life in and out of relationship. Working with a therapist, you may be able to gain insight into how you show up in your relationships with yourself and others and discover more fulfilling ways to do so."
        ]
    },
    {
        "tag": "Ex has moved on",
        "patterns": [
            "My ex is with someone new and it is hurting me"
        ],
        "responses": [
            "I am very sorry for the pain you are suffering. Losing the most significant person in your life is extremely painful and breakups are often equated to a death. There will certainly be a grieving process that you go through and time passing will allow the hurt to subside. With that being said, seeing a therapist is highly recommended as it sounds like continuous support may be necessary for healing to take place. Anytime sadness causes thoughts of suicide or self harm, it is important to get help immediately. A therapist can help you by validating your feelings and what you are going through, while also working with you to move through the grieving process, adopt new hobbies, social outlets, and goals for your future.  While starting over and trying out new ways of being may seem like a daunting task, it will only make things easier and give you a sense of hope and purpose for your future. With the new year right around the corner, this could be viewed as a good time and opportunity to get re-acquainted with yourself and set goals related to living a more fulfilling life. Hang in there. With a support system in place and a healthy mindset, things can only get easier.  Best of luck to you!"
        ]
    },
    {
        "tag": "Depression,Self-esteem",
        "patterns": [
            "I always feel like I'm not good enough and it literally is so hard living. I don't know how to talk to my parents about it."
        ],
        "responses": [
            "This is a really hard problem for many people than they let on.  If you need someone to talk to, consider a teacher or a school guidance counsellor or someone you respect, maybe in church. If they're good and they don't know how to help you, they may know how to get you to someone who can. Also, the idea of not being \"good enough\" is a common psychological event. In CBT it's called a \"core belief.\"  I hope this was helpful. The future is filled with possibility if we don't pre-judge it!"
        ]
    },
    {
        "tag": "Self awareness",
        "patterns": [
            "How do I get to know myself? ",
            "I still don't know myself. I fell into a spiral and got depressed."
        ],
        "responses": [
            "To answer your question of how do you get to know yourself try answer questions such as the following: What do I love?, What are my own needs and desires?, What 3 things have I accomplished in my life that I'm most proud of?, What are 5 strengths or qualities I have?, What is one event that had a major impact on my life?, How have that event affected my life today?, Try to write a letter to yourself and tell yourself what you love, cherish, appreciate and even admire about yourself."
        ]
    },
    {
        "tag": "Learn emotions",
        "patterns": [
            "How do I learn to feel emotion? ",
            "I don't know how to have emotions.  I never had any from my birth.  Being human, I think of myself as a monster."
        ],
        "responses": [
            "I'm not sure that you don't feel emotion or that you are frightened of the depth of your emotions. I wonder whether you've taken on stories you heard growing up about how unacceptable and bad you are. A way to start learning your emotions is to start in simple, basic ways to ask yourself what you are feeling in the situations that you believe emotions would belong.  If on the first bright sunny and warm day of the year, you remind yourself to notice what you're feeling in response to this, you'll be taking one step toward awareness of your emotions. If someone buys you a birthday present, be aware of how you feel. Keep adding awareness to situations and see if this builds an ease with feeling emotions. "
        ]
    },
    {
        "tag": "Depression,Sleep Improvement",
        "patterns": [
            "I've been really weird with my sleeping patterns"
        ],
        "responses": [
            "As silly as it may sound, making sure that we are getting the right amount of *restful* sleep is very important when we are feeling low. The reason for this is the lack of proper sleep significantly affects our ability to problem solve and critically evaluate our situation and can lead to a domino effect in our thinking."
        ]
    },
    {
        "tag": "Depression,Social Relationships",
        "patterns": [
            "Does my friend have depression? ",
            "I am really worried about one of my friends because I think he has major depression. He disagrees with me on that. He is shut off when it comes to talking to people and telling them how he really feels. He told me he feels empty inside and the only emotions he feels are anger and sadness. I suggested to him to get help and talk to his mom about it but he refuses."
        ],
        "responses": [
            "First of all, I can tell that you really care about your friend and I think it's great that you are reaching out with your concern.  It's hard to determine whether your friend would meet the criteria for an official diagnosis of depression without working with him, however, whether he does or not, therapy may be beneficial for him in working through these difficult feelings and relational challenges. Unfortunately, you can't make your friend get help. He will ultimately need to make that decision for himself, however, you can talk to him about your concerns and your hopes that he will reach out for help."
        ]
    },
    {
        "tag": "Diagnosis,Counselling Fundamentals",
        "patterns": [
            "How does a counsellor diagnose someone with a disorder? "
        ],
        "responses": [
            "A lot goes into diagnosing for a disorder. It is according to what the provider's assessment from information gathered, reported and observed from the client."
        ]
    },
    {
        "tag": "Domestic Violence,Relationships",
        "patterns": [
            "How do I get out of an abusive relationship? "
        ],
        "responses": [
            "That sounds like a very hurtful situation. Unfortunately, without a batterers intervention course or a desire to change, the abuse cycle is unlikely to stop. I do not recommend that you try to leave on your own due that being the most dangerous time when in an abusive relationship. As an abuser, his goal is to control you whether it's through mental or verbal means. I recommend that you contact a domestic violence shelter in your area."
        ]
    },
    {
        "tag": "Eating Disorders",
        "patterns": [
            "I hardly eat. But I gain weight instead of lose weight. Why?"
        ],
        "responses": [
            "First step always is to have a medical evaluation so you are aware of any physiological conditions which may explain an answer to your question.  If medically, there is no condition to explain why you gain weight instead of losing weight, even though you \"hardly eat\", then start noticing the types of food you eat. Almost all packaged foods sold in supermarkets and cooked by fast food places and shopping mall restaurants, are processed to have a long shelf life and are artificially colored and have flavors added to them. With the natural taste and texture gone, it is very easy to eat a lot more calories than your body needs, before feeling full. The extra calories become extra weight eventually. Also, it is possible that even with the most natural food choices, if there is a psychological reason for eating, such as stress or anxiety, then someone may not notice they are eating more food than their body needs. Sending good wishes on playing around with these ideas and finding an answer with which you're happy!"
        ]
    },
    {
        "tag": "Eating Disorders,Addiction",
        "patterns": [
            "How can I train myself to stop eating when I'm full? ",
            "I have no self control over food. Most people stop when they've had enough, but I keep eating for the pleasure of it. Especially with sweets, I'm never done eating dessert."
        ],
        "responses": [
            "I would recommend removing yourself from the environment you are in after you have finished eating. A simple walk around the block, calling up a friend and going to visit a friend may help. You can also try going to another room in the house. If you find that you truly have no self control over food, I recommend joining a support group. I hope this helps.",
            "Hello! I'm so glad you decided to write in today. This is such a great question and I'm sure many others will relate to exactly what you're describing. There are a few different ways we can look at in understanding your concern. First, I think it's important to understand food is just food. Food is meant to nourish our bodies, provide us with energy and yes, sometimes reserved for special occasions and celebrations. But in many cultures, we place a lot of emphasis on food. We have food at every gathering and every celebration. What's more people have come to almost EXPECT food to be present at any and every get-together. Another aspect we need to remember about food, is to think about what we're getting from overindulging or overeating. Are you trying to drown out other emotions? Are you trying to feel better and the food gives you that feeling for a brief moment? What ELSE is going on?  This can be determined by utilizing what we describe as a Thought Record. A Thought Record involves tracking and identifying thoughts and feelings associated with food triggers. By targeting the emotions, we can then determine where they're coming from, as well as how to decipher them. A therapist can also help you with understanding your emotions related to food and will be helpful in assisting you with the Thought Record. The most important thing to remember is that food addiction can be a real problem for a lot of people. If food is taking over your life and you are preoccupied and overwhelmed with knowing where to start, please seek out help. Binge eating is the most common eating disorder and impacts the lives of thousands."
        ]
    },
    {
        "tag": "Eating Disorders,Legal & Regulatory",
        "patterns": [
            "Can a therapist have a client admitted to an eating disorder treatment center if the client does not want to go?"
        ],
        "responses": [
            "Typically, a therapist cannot force a client to receive any treatment they do not want. In the end, it is the clients who get to decide what type of treatment they want. If a therapist believes that their client is in imminent danger of harm however, the therapist might have an obligation to take actions to protect their client. In such a case, the therapist would need to discuss the options with the client, and come up with a plan to best protect the client.  In a situation like this, it would probably be a good idea to talk to the therapist about the possible positives and negatives of the treatment centre. A good therapist will be happy to have that conversation with you and allow you to make the final decisions about your own treatment.  "
        ]
    },
    {
        "tag": "Family Conflict",
        "patterns": [
            "What do I do about a cousin who makes me feel belittled, insecure and frustrated? "
        ],
        "responses": [
            "Do you have a close friend or relative who's opinion you trust? Ask them for their honest feedback and if they see you like your cousin does. If they don't see these qualities in you, then it may be your cousin's issue and she's taking it out on you. You can always ask her what would be the best way to communicate plans with her so you know, specifically, what she is expecting. Then if you meet these expectations and she still blames you and comments on how inconsiderate you are, it's her issue and she is not coming from a place of love. Even if you do resemble her comments, the way it sounds like she approaches this problem is not out of love. The fact that you're introspective enough to consider your own behaviour suggests the problem is not with you."
        ]
    },
    {
        "tag": "mom get mad easily",
        "patterns": [
            "Is it normal for my mom to get mad easily?"
        ],
        "responses": [
            "You are very wise. You have already figured out that other people's behaviours and how they treat you, is  not about you. It's about them. I love that you don't blame yourself for your mom's behaviours. It's not your fault. She's getting upset because she doesn't know how to manage her emotions, and these emotions have to do with her past and her present stress. You're just the trigger. Yes, this is normal, but it's not necessary. She can find another way to manage her \"stuff\".  Unfortunately, you can't help your mom a whole lot or even help her recognize this. But for yourself, remembering that her behaviours are her issue is the biggest piece of \"dealing with it\". You can always try some new strategies when you talk to mom. You can say \"I'll listen to you better if you don't bring up past stuff\", or \"I'm worried about you mom. You seem stressed\", or even \"I don't like the way you talk to me\". Good luck!",
            "Anger is a normal emotion, and yet it is a really hard to know how much is too much and how do you express it without damaging those around you? You shouldn't have to fix or calm down mom's anger. Maybe in a calmer time when you guys are being silly, talk with her one on one?  Tell her how you are feeling sad and hurt that she gets upset at you.  Ask her if there is one thing you can work on this next month to help her.  Ask her if she would work on one thing for you this month for example, not yelling at you? Also for you, check out a library book on anger so you know how to handle yours, and one on parents and anger.  Number one to remember, if you don't feel safe, if she is calling you names, or hurting you, breaking things etc.  make sure you go to a trusted adult for example a school counsellor, neighbor, aunt, church friend as soon as possible. You are much too important to be hurt and if mom is out of control, someone else needs to be caring for you."
        ]
    },
    {
        "tag": "not love my sister",
        "patterns": [
            "Is it wrong that I don't love or even like my sister? "
        ],
        "responses": [
            "Hi. My guess is there's a lot of deep history here that I don't know about. Have you felt hurt by your sister in the past, or are you just 'different people'?  It's a common feeling people have about their siblings which is very different and they wouldn't choose them as friends, but most people stay connected to family unless there's a good reason not to. We don't choose our family, do we? Your feelings are normal and they don't make you cruel. If you were mean to her, that might be a different thing. It might be considered cruel to cut her out of your life for no reason, but choosing to not hang out with her a lot isn't cruel, in my mind. Perhaps you at least owe your sister kindness and respect that's if she respects you, but not necessarily friendship",
            "Not liking someone is not cruel even if it is a family member. There is nothing wrong with you for not liking your sister. Some people are fortunate to have siblings that they get along with really well, other don't. We all have different personalities and we are not going to like everyone even if they are related to us. In fact, sometimes being related makes it harder because you know all of each other persons flaws and imperfections. With that being said it may be worth making an effort to talk about the things that get in the way of having the kind of relationship that you might ideally want with your sister.  Sometimes it is hard to like someone if we have a lot of old frustration and resentment and being able to talk about it in a constructive and kind way can lead to more understanding and respect, and sometimes actually lead to liking each other."
        ]
    },
    {
        "tag": "emotionally abused",
        "patterns": [
            "I'm being emotionally abused by my dad. I need advice on how to hold my temper with him."
        ],
        "responses": [
            "First, I'd like to say that I can't imagine what it must feel like to live in your shoes and have to be exposed to such treatment. Often are the times, people don't recognize how serious this type of abuse can be. It's very important you first recognize that it is absolutely impossible for any of us to change a person. So the only thing you have control over is you, your response, your set boundaries, and your support system.  It's very important that you set healthy boundaries, express these expectations to him, and consistently follow them.  I cannot stress how important have a strong support system / a circle of caring people who can help keep you accountable with your boundaries and who you can reach out to if you ever feel your safety is at risk. There is only so much I can explain via writing so let me know if you need any additional help."
        ]
    },
    {
        "tag": "Family Conflict,Depression",
        "patterns": [
            "How do I tell my parents that I'm depressed and need help?"
        ],
        "responses": [
            "Opening up to them at times might be a little bit hard. The best approach to take is to find them when they are calm and in a peaceful environment where you can have an open conversation about your mental health and how you would really appreciate their help."
        ]
    },
    {
        "tag": "Family Conflict,Legal & Regulatory",
        "patterns": [
            "How do I find a therapist for my family as a minor?"
        ],
        "responses": [
            "This sounds like a really tough situation. As a minor, you may be able to get counselling on your own without needing your parents' consent under some circumstances. If your parents are refusing to consider counselling, you might want to try talking to your doctor or another trusted adult about finding some counselling resources even without your parents' help."
        ]
    },
    {
        "tag": "Family Conflict,Relationships,Intimacy",
        "patterns": [
            "As I was growing up, my parents always fought. With that, I grew trust issues. I think it's going to affect my relationship now and end it sooner than I want to. I try not to let it affect me, but I can't."
        ],
        "responses": [
            "If you think your trust issues are going to end or affect your relationship it will because you are bringing baggage from your parents into this relationship, don't allow their problems to become your problem. You didn't mention that your partner in your present relationship have done anything to make you not trust them. Like in the court of law, if no evidence you are found not guilty. Don't make your partner the consequences as if guilty of your parents unhealthy behaviour."
        ]
    },
    {
        "tag": "not good enough",
        "patterns": [
            "How do I cope with \"never being good enough? \" ",
            "I'm always told I'm not good enough or trying hard enough.  I put 100% in to every thing. I'm worn out, I've worked on all of my family relationships, I'm doing great in school, I'm kind to those in need and otherwise. I stick to my religious beliefs and leave room for mistakes and learn from others so I don't have to make as many and the ones I do I learn from. Somehow it's still not good enough and nothing I do works. Nothing has changed, and I feel hopeless. Any suggestions or ideas?"
        ],
        "responses": [
            "The feeling of never feeling good enough usually stems from our early relationship with our parents or significant role models who made us to feel we were never good enough to meet their standards. In the healing process, you'll need to work on discovering the root source of where these thoughts and feelings come from and then learn to accept yourself just as you are unconditionally.",
            "Hello, and let me start by saying, what a great question! There are so many people putting forth their 100% everyday and often times, do not get the credit they deserve. Without being able to fully understand where you're question is coming from, I think there are a couple of different ways to look at this question. First, I think it's important for us to consider the message being sent by those in your life stating that you're not good enough. Is that actually what they said, or is this just what you heard? Sometimes, because of our own self-doubts and fears, we skew and misinterpret the messages we receive from others. Again, listen to the message being sent and attempt to remain objective. Is the message being sent coming from a place of love or concern? If so, have an honest and open communication with that individual about what your concerns are regarding the amount of energy and time you're spending on being good enough. Explore with them how you feel that you're already giving your best. If the person is unwilling to work at understanding this concern you have, then it may be time to explore the relationship. Some relationships we engage in can be toxic, especially if the other person is toxic. It may be they have their own  going on and they feel the need to constantly put others down to make themselves feel better. If you're in the direct path of this individual, then it serves to reason you will probably be in the direct fire, as well. Explore whether or not you want this relationship to continue in your life. If it's a relationship that must continue, then work on what you will do to distance yourself from their toxicity or their problems. Until they're willing to work on these issues for themselves, then it may be necessary to find an exit strategy, such as leaving the room or simply refusing to engage in the conversation. Another perspective of this question is exploring the reason why it's important for you to satisfy the expectations of these other individuals? No one will ever be 100%  good enough  for everyone. Every single person has their own set of expectations in themselves and expectations in others. It would be impossible to satisfy all of those expectations for every single person in our lives. The question becomes, what is it within you that feels the need to meet these expectations? There is most likely a part of you, yourself, as an individual that feels less than and feels as if you, yourself, are not good enough. If you already feel as if you're doing everything you can do to be at your best version of yourself, then really work on letting go of the rest. No one is perfect, and striving for perfection in our lives only creates more anxiety and stress. Find a middle ground in which you are happy with your accomplishments and your daily goals, and learn to let go of what's left.  After all, tomorrow is a new day and you can work on more of your goals tomorrow! I recommend doing this by finding a mantra, a statement or phrase you can repeat to yourself anytime you start to feel that sense of stress and pressure from striving for perfection. The mantra can remind you to let go of this expectation you have for yourself or that others have for you so you can also let go of the stress and anxiety surrounding the expectation I leave you with one of my favorite quotes that perhaps you can use as your mantra,  'No one can make you feel inferior without your consent.' - Eleanor Roosevelt"
        ]
    },
    {
        "tag": "Family Conflict,Self-esteem,Parenting,Anxiety",
        "patterns": [
            "What can I do if my parents refuse to acknowledge my anxiety and self-confidence issues?"
        ],
        "responses": [
            "I'm sorry to hear that you are unable to get through to your parents. It sounds like you are experiencing a great deal of anxiety that needs to be addressed by a professional, despite the fact that you are unable to at the moment, I would recommend talking with another adult such as a  school counsellor that can offer you support in this area. Perhaps they can work with you on your anxiety issues and schedule a meeting with your parents so that he/she may help mediate the conversation with them. If you are unable to reach out to a school counsellor maybe you can try a member of the family such as an aunt or an uncle that feels comfortable addressing the issue with your parents. Sometimes it helps hearing it from a third party before the situations is taken seriously enough. Good luck!"
        ]
    },
    {
        "tag": "Family Conflict,Social Relationships",
        "patterns": [
            "Can a person be mean towards another person if that person was treated poorly before?"
        ],
        "responses": [
            "There's a saying that goes \"hurt people hurt people\".  It's possible that your aggression towards your friends is connected to how you were treated when you were young maybe by your parents or guardians or anyone.  When we are treated poorly, especially as children, it affects how we view ourselves, others, and the world. It's also powerful modelling of aggressive behaviour. The good news is that you have this lovely awareness and I think a desire to learn about yourself and grow in your ability to be respectful to people you care about. I recommend you consider sitting down with a therapist and exploring these ideas and moving forward on that path you seem to want to be on. Good luck!"
        ]
    },
    {
        "tag": "Family Conflict,Stress,Sleep Improvement",
        "patterns": [
            "Is it normal to blame myself for someone else's actions?"
        ],
        "responses": [
            "To answer your heading question, yes, it is quite common for people to blame themselves for other people's actions. There are various reasons why we do this. And depending on things like our relationship to that person, past experiences, and our self-esteem, we may actually start to believe it. It is important to remember that you are not responsible for other peoples actions."
        ]
    },
    {
        "tag": "Family Conflict,Trauma",
        "patterns": [
            "My father has always been horrible to me. "
        ],
        "responses": [
            "what you don't need is to be verbally abused by someone who's supposed to love and protect you. It's your right to spend your time with the people who love you properly. That's a really important part of learning how to be happy through carefully choosing who's going to be in your life. A good therapist can support you in these goals. I wish you the best in your growth as an independent adult."
        ]
    },
    {
        "tag": "Grief and Loss",
        "patterns": [
            "How do I cope with losing my mom? "
        ],
        "responses": [
            "First, I want to say how sorry I am for your loss. The grief of losing a parent can be very difficult to work through. When you lose someone you love, you are forever changed. The goal of working through any loss is to reach a new normal. Though you will never forget your mom, the grief processing is about learning to live in a different way, without her physical presence. One of the best things you can do is find a good support system. You need to talk about your loss, and talk about it a lot. Talking helps work through your emotions and reach a place of healing. Find friends you trust who can support you or find a good grief support group. They are hugely beneficial since the group will understand exactly how you feel. If you find you are still struggling, a good grief counsellor will also help."
        ]
    },
    {
        "tag": "Stop grieving my mother's death",
        "patterns": [
            "What can I do to stop grieving my mother's death? When I am awake I just cry every day. I don't have anyone to talk to. Will I ever stop crying? It's been 3 years.",
            "How do I stop grieving my mother's death?"
        ],
        "responses": [
            "I am sorry that you lost your mother. That is a really hard thing for someone to go through. There is really no set time for grief to be over, but I agree that if it has been three years and you are still crying every day then this is past the time for normal grief. I do not know how old you are and if you are in school or have a job, but I would imagine that if by now you literally were doing nothing but crying every day all day, someone would have noticed and would have gotten you some help. There are typically five stages of grief and they can come in any order. You can go back to another stage that you previously experienced.  Denial, anger, bargaining, depression, and acceptance are the stages.  At first, people are usually in denial over the fact that they lose someone or are losing someone. This may mean that you deny they are ill or deny that they have actually died. Then comes bargaining, in which you may beg God that if you can only have this person back then you will do whatever. Depression is when the reality has settled in and when we cry and really feel the loss. It sounds like you are stuck in this phase. Finally, acceptance is when we accept that it has happened and we pick up the pieces of our life and move on. When we lose someone we never forget them. We may always have certain days that are tough, such as holidays or any special remembrance of your loved one. But we do get to the place where we accept that death is part of life and that it is inevitable, and that life goes on. A therapist can help you explore the reasons for your extended grief and can help you with coping skills to better deal with it. One suggestion I have is not to try to run from the sad feelings, don't try to not feel them. Embrace the feelings. Let the feelings wash over you and accept them. Trying not to feel something is not going to help. Sadness is a part of life and needs to be felt just like happiness does. Unpleasant feelings are not to be avoided. I am sincerely sorry that you loss and that you have had such a hard time of it for three years now. You deserve to be happy and to live a full life. I am sure your mother would not want you being sad for so long. I wish you all the best as you continue to try to heal from this loss and deal with your grief."
        ]
    },
    {
        "tag": "Grief and Loss,Depression",
        "patterns": [
            "How can I get over my depression and grief?"
        ],
        "responses": [
            "It's never too late to get help with grief. Get help as soon as possible. Get help with coping with his loss will make life easier to live."
        ]
    },
    {
        "tag": "Grief and Loss,Family Conflict",
        "patterns": [
            "I lost my parent, and I feel like I'm depressed.",
            "I lost my mum, and I feel like I'm depressed.",
            "I lost my dad, and I feel like I'm depressed."
        ],
        "responses": [
            "Wow what a painful journey you have been on. Death and grief bring up so many painful reminders of relationships and what they could have been, never were, and what was lost. With death of a family member the family often falls apart for a while. . .  or longer.  I hope you can find some support for you and your pain that was occurring before your parents passing."
        ]
    },
    {
        "tag": "Human Sexuality",
        "patterns": [
            "How can I control my sexual urges?"
        ],
        "responses": [
            "Anything can become an addiction eating, gambling, shopping, sex, even exercising.  It sounds like this has become a behavioural addiction for you. A therapist can help you identify the underlying reasons and help you learn to control the urges and develop healthier coping habits. People turn to an activity that makes them feel better when something is bothering them emotionally or mentally. Anything can become a problem if you overuse it. This is why it is important to have a healthy balance of activities in your life; more than one thing that you can turn to in order to help you cope. Addictions are formed when we turn to the same thing over and over again. Sex is a very powerful addiction for some people. It makes us feel good. We get pleasure from it. I had a client that turned to eating as her addiction. The advice I gave her applies to your situation as well. Eating is something that we have to do and that an addict can't walk away from.  My client could not tell when she felt the urge to eat if it was because she was hungry or because she was upset about something and was subconsciously turning to food to make her feel better. Her body was telling her brain that she needed to eat. I asked her to first STOP and THINK when she felt the urge to eat. Look at the clock and mark the time. Tell herself that in one hour if she was still hungry then she could eat, but that she needed to find something else to occupy her mind and her time until the hour had passed. She tried this for a week. She said it worked. She would get busy reading a book, watching TV, or would go for a walk around her neighborhood for exercise and these activities would take her mind off things and the hour would pass and she wouldn't even notice the time. What this did for her was stop an unhealthy behaviour and replace it with some healthier activities. She had to learn to first recognize when she was feeling the urge, and then to come up with other activities to do instead. You can do this with your urges. Having sexual gratification as your coping method is causing you distress. Make a list of other activities that you like and that you can engage in, and when you feel the sexual urge, make yourself do another activity for an hour to get your mind off of it. It may take a few tries to find an activity that will hold your attention. A habit that has developed over time is not going to be so easy to break. Please go to a medical doctor and get evaluated as well. They can do lab work and check your hormone levels. If needed, medication can help. After being cleared medically, counselling can help you."
        ]
    },
    {
        "tag": "sexual tension",
        "patterns": [
            "How do I deal with sexual tension?"
        ],
        "responses": [
            "What you're experiencing is normal. We're sexual beings and have a in-built desire to connect sexually with others, because it feels good, to keep procreation going, and mostly to \"connect\" with other people, because connecting with others makes us feel fulfilled and valuable. Sexual desire is a healthy part of you. It sounds like you're beginning to explore yourself sexually, and that's okay. It's okay to connect sexually with others, as long as you're preventing disease and pregnancy and you know how to protect your boundaries.  But even as I write this, I think maybe I'm being controlling and overprotective of you; it's your body and you're in charge of what happens to it! (But I do want you to be safe. . . whatever that means to you).  Maybe talk to someone you trust.  With each encounter you have with other people (sexual or not), you will learn more about yourself and what you want, both sexually and just in relationship or friendship. You will develop a sense of who you are. Have you tried to get to know yourself sexually? This is a super place to start, and knowing how your own body works can give you confidence when you eventually connect with others. When you explore your own body,what feels good?  What brings you to orgasm?  I wish you well as you explore both who you are and how it feels to connect with others safely."
        ]
    },
    {
        "tag": "afford",
        "patterns": [
            "How can I see if a therapist if my mom can't afford it?"
        ],
        "responses": [
            "You can get free counselling from the Strathmore Mental Health Department"
        ]
    },
    {
        "tag": "Legal & Regulatory,Professional Ethics",
        "patterns": [
            "Can a past therapist disclose information to a current therapist that you are seeing?"
        ],
        "responses": [
            "They are bound by confidentiality. They can only wave this confidentiality law when the patient is in danger or is a danger to others."
        ]
    },
    {
        "tag": "Ignoring calls",
        "patterns": [
            "Is it ethical for a social worker to ignore a client's phone calls?",
            "Ignore calls"
        ],
        "responses": [
            "Yes, your former social worker should return your phone call. It is the professional and ethical thing to do. If he doesn't, there is nothing you can directly do about the fact of his ignoring you. There are formal complaints you can make, which you can consider doing. What matters most is receiving social work service. Stick with looking for another social worker who is willing to help you. The self-doubts you mention may be worth examining. They do not, however excuse the social worker mishandling himself."
        ]
    },
    {
        "tag": "lying to parent",
        "patterns": [
            "I lied to my dad, then felt bad and told him the truth",
            "I lied to my mom, then felt bad and told her the truth",
            "I lied to my parent, then felt bad and told them the truth",
            "She cried because she lost all trust in me and thinks that I lie to her.  Now I feel disgusting and my heart felt like it just got stabbed, what do I do?"
        ],
        "responses": [
            "It sounds like you've already learned that just being honest is often the best approach. What do you think about telling your parent how you're feeling? They might really appreciate it if you also let them know that regaining their trust is really important to you.",
            "Hey! Sounds like the part of you that knows the RIGHT thing to do won here! I am so proud of you for admitting that you lied to your parent! Sometimes lies come out of our mouths before we can even catch them because we are trying to say what the other person wants to hear. I bet that, as you begin to show them that you are not going to lie any more, they will begin to gain trust in you again!  Be open with your feelings with your parent - they are there to support you, guide you and love you! Give them lots of hugs and give yourself one too for being so brave!"
        ]
    },
    {
        "tag": "Professional Ethics",
        "patterns": [
            "I'm worried I should see a therapist due to past events and current mental status. I'm just so unsure of how to ask my doctor about seeing someone."
        ],
        "responses": [
            "Having this kind of conversation with a doctor can feel difficult. But remember, you are the expert on you. Any good medical professional will recognize that. You are absolutely right to think about the importance of being your own health care advocate. Generally, the best approach is simply to be honest. Let your doctor know what you are concerned about and tell your doctor what you think might help. If there is a specific issue that you'd like to address in counselling, let you doctor know about it. And don't hesitate to directly ask for a referral. I know this may all feel a little overwhelming. It might help to bring a family member or significant-other with you to provide support when you talk to your doctor. It's great that you've already taken this first step to reach out. You're on the right track.",
            "Thanks for your question, I'm glad you realize that you need extra support and are being proactive. Simply explain to your doctor the feelings you have been experiencing and how you feel that speaking with a mental health therapist would be beneficial. However, keep in mind that you do not have to go into detail about your personal feelings. You can simply state that you are feeling down, overwhelmed, stressed, or whatever it may be I'm sure your doctor will be glad to direct you from there. Best of luck to you! I hope that you will be feeling better soon!"
        ]
    },
    {
        "tag": "Trust Betrayal",
        "patterns": [
            "My therapist betrayed my trust"
        ],
        "responses": [
            "I'm sorry to hear that this has happened. Counsellors are legally and ethically required to make sure that they always put the well being of their clients above their own interests. In addition, counsellor ethical rules, and the law, make it illegal for counsellors to take advantage of a client financially. There are a few options you have at this point if you can't (or don't want) to continue to try to contact him directly. You can file a complaint with Kenya counselling and Psychological Association (KCPA) and let them know what has happened. An investigator will then look into the situation for you. Another option would be for you to find a different counsellor who can provide you with an independent and neutral point of view to help you figure out how you want to handle this situation."
        ]
    },
    {
        "tag": "New therapist",
        "patterns": [
            "I have an eating disorder of binging.  I've had gastric sleeve surgery.  I need help with issues of abuse as a child, addiction, and abusive men.  I have been in therapy for five months and get no feedback from my therapist.  Should I get a new Therapist"
        ],
        "responses": [
            "It can be really frustrating to feel like your counsellor is not providing you with the help you need. My recommendation in a situation like this would be to let your counsellor know how you feel. Specifically tell Your counsellor that you don't seem to be getting the amount of feedback you would like. If this doesn't help, then you might want to look for another counsellor who will be a better fit for you. "
        ]
    },
    {
        "tag": "Gift Therapist",
        "patterns": [
            "Is it appropriate to gift my counsellor",
            "Is it appropriate to gift my counsellor"
        ],
        "responses": [
            "Different therapists are guided by the ethical guidelines of their own associations or colleges when it comes to receiving gifts, so this may differ a bit from therapist to therapist. It's important to me that I be sensitive to cultural norms, and to my client's needs. It is never necessary to give a therapist a gift, but if you wish to express your gratitude in this way, I don't think it's inappropriate.",
            "This is a great question. In general it is not appropriate for counsellors to accept gifts from their clients. There are some exceptions to this general rule - including a recognition that there may be a valid cultural aspect to this type of gift giving. It might be best to simply offer your counsellor a holiday card as an expression of your feelings. You could also talk to your counsellor about the gift and ask if him it if would be appropriate In the end, I know he would most appreciate just knowing how much the counselling meant to you."
        ]
    },
    {
        "tag": "Want to be a better human",
        "patterns": [
            "I want to become a better human.",
            "better person"
        ],
        "responses": [
            " What an important question, and the fact that you're asking it is a big step in the right direction. The first step for making this sort of change is being motivated to change and it sounds like you have that, so you are already on the right track. Try and become a better listener.  Also focus on your goals and your path will come to be with time."
        ]
    },
    {
        "tag": "Difficult communication",
        "patterns": [
            "I have difficulty with communication. ",
            "I am a really shy person.  I'm currently in a graduate program which requires lots of presentations, but they always make me feel stressed out and less confident.  How can I get more confident? "
        ],
        "responses": [
            "Have you tried rehearsing to yourself or a trusted friend what you will present to the class? The more confident you feel in a safe space, the more chance there will be of making the same presentation to a larger group. Giving presentations is not necessarily a difficulty with communication. It has more to do with performance than expressing yourself clearly. Practice, practice, and practice, until you see yourself improve in how you present.   Also, keep in mind that whatever anxiety you may feel about making a mistake, the audience is almost alway much more forgiving than the person who feels anxious.   Anxiety heightens fear, so whatever concerns you have, check if they are growing from anxiety instead of a realistic assessment of your abilities or audience receptivity.   Good luck! "
        ]
    },
    {
        "tag": "Overcome fear",
        "patterns": [
            "I have a fear of something and I want to face that fear to overcome it, but I don't know how.  What can I do? ",
            "I am scared of something and want to overcoe it"
        ],
        "responses": [
            " Biologically, fear is designed to protect us from harm.  Fear is not always a bad thing, and in fact can be quite healthy and appropriate depending on the situation. A phobia, however, is different.  You used the term \"fear\" rather than \"phobia\". A phobia is an irrational fear - meaning it is not rational for you to fear that thing.  If your situation is a phobia, exposure therapy can help.  This consists of gradually exposing yourself a little at a time to the thing you are afraid of.  Some people with phobias find that the irrational fear interferes with their life and they do need to overcome it.  Someone who is afraid to drive over bridges may go to great lengths to avoid routes that have bridges.  People who are afraid of elevators may always use the stairs instead, which may not always be feasible.  If overcoming a phobia will improve the quality of your life, then by all means, seek professional help to overcome it.   Everyone has fears, or things that make them nervous.  Public speaking, asking a person out, fear of failure.  Examine what your fear is and try to determine the reason for the fear.  When you can get to the root cause of the fear, you can deal with that issue.  A lot of times, it is a self-esteem issue.  You may be able to peel back the layers of the fear and find out what's causing it and deal with the real issue.   Some fears are caused by trauma.  Someone with PTSD is going to have an exaggerated fear response and will find themselves being kicked into \"fight or flight\" mode over things that someone without the trauma experience wouldn't notice or react to.  In cases like this, exposure therapy would be the wrong approach and could actually make things worse.  If there is a possibility that a past trauma is the cause of your fear, I strongly urge you to seek a therapist - not just any therapist, but one who is trained to work with trauma and abuse victims.  "
        ]
    }
]
}